{
  "adium": [
    "seems like working within constraints is part of the fun",
    "aside:I love that you used rebecca purple"
  ],
  "alistair": [
    "beautiful morning here in melbourne",
    "just discovered ÔÇ£90s radioÔÇØ on spotify"
  ],
  "anovak": [
    "Now it proclaims me to be an expert!",
    "Ooh twine is cool, but I have no idea how to twine.",
    "Have y'all played the *amazing Twines of Porpentine*?",
    "How else will I put witty aphorisms on my web pages?",
    "Fortune is a vital part of the command-line experience",
    "I think I have this always drunk thing down",
    "Just subject yourself to beauty until you fall over?",
    "Maybe I'm reading the wrong poetry.",
    "They can get really dark, and somewhat terrifying",
    "The one I mentioned, for example, ends in the word \"butts\".",
    "Most of everything is incredibly boring.",
    "Just stars being stars and planets being planets.",
    "Twitter is an exercise in collecting cool quotes.",
    "Oh yes we should collect the cool for our server",
    "There is a whole world of human experience I suppose.",
    "I am not really sure what animals are like.",
    "That is pretty much how animals work, I think.",
    "\"Concerning the inevitable destruction of all things\"",
    "Humanism sounds kind of racist against aliens.",
    "So the more we argue about philosophy the better we get?",
    "It depends what you're burning down.",
    "We only have contemplative, reflective chats here.",
    "Many moments are actually terrible.",
    "Teach them the ways of the Unix",
    "kc: If there's one thing users are not, it's smart"
  ],
  "audiodude": [
    "if that's not cheap whiskey, what is?",
    "the old crow is in a plastic handle",
    "less is a binary, you can't drink it",
    "I'm a firm believer in doing a little bit often",
    "grumble grumble emacs holy war grumble",
    "yes, tell me more about backtick plz",
    "the source is available by simply \"view source\"",
    "I think my favorite is \"Temple\"",
    "it's some pretty impressive stuff",
    "I was definitely trying to do something else lol",
    "you have a paddle and you try to catch moving dots",
    "but it actually is not design for the sake of design",
    "marcus: my project for 2015 is \"One Song a Week\""
  ],
  "audy": [
    "oh neat cron mails you when there's an error",
    "is anyone keeping a list of programs/scripts on ~town?",
    "\u0001ACTION imagines a protein-protein docking simulation party\u0001",
    "hmm.. 103 users have never logged in",
    "there's a while 1 loop without a sleep",
    "I found a place that has turkish coffee",
    "I'm about to purchase a domain help",
    "stop me from buying yet another domain name",
    "puppet frightens and confuses me",
    "I managed to get a tilde running on ubuntu",
    "\u0001ACTION twiddles with configs\u0001",
    "my puppet conf doesnt have a [master] section",
    "there is also no puppet-master package on pacman",
    "\u0001ACTION was thinking of making a fireplace\u0001",
    "dan: testing some permutations of the tilde idea",
    "want coffee. out of milk. but there's eggnog",
    "reppard: with unit classes and skills and levelling up",
    "reppard: is curses in the standard ruby lib?",
    "also because it is fun to implement things from scratch",
    "I want to learn a new programming langauge for Year.new",
    "\u0001ACTION contemplates tilde on docker\u0001",
    "\u0001ACTION is logging # of connected users\u0001",
    "trying to revive my raspberry pi",
    "wee hello from raspberry pi (I had to ssh into laptop first)",
    "anyone generating RSS feeds on ~town?"
  ],
  "bt": [
    "i'm just lurking. i'm new to the \"irc thing\"."
  ],
  "cammikebrown": [
    "Oooh nice, I hate most '-isms'",
    "I am right now distractedly playing a round of peggle",
    "I'm looking up how to use irssi",
    "I just got into this site like... 5 minutes ago",
    "I know emacs better than vim but I don't know much...",
    "what's the irc server? irc.tilde.town ?",
    "I'm on a 2007 macbook pro right now",
    "It supports 3 (not 4!) gb of ram",
    "well, turns out they may not be AS better as people thought",
    "this multiple screen thing is cool",
    "are you guys making tilde.town?",
    "I only have to paste that in my site?",
    "I AM NOW A PART OF THE WEBRING",
    "are you guys on multiple tilde sites? Or just this one?"
  ],
  "cary": [
    "oh lol that must mean the entire server is full",
    "karlen: oohh I'm stealing that if you don't mind",
    "I'm super new to using windows"
  ],
  "cmr": [
    "\"1996: became linux extremist\"",
    "hell yes #ffa on black top no. 1 color"
  ],
  "coaxial": [
    "Is there any recommended read to tke this to the next level?",
    "I need to use my own domain name",
    "But yeah half of it is broken now. And very spaghetti.",
    "I remember someone wrote a telemarketer torture thing"
  ],
  "colby": [
    "Just finished watching Pitch Black",
    "Whelp, off to sleep. Have a great night everyone."
  ],
  "dan": [
    "it's it's pretty nice once its up",
    "fyi the default tilde.town vim theme is called elflord",
    "i made this last night: ~dan/proggies/vanity.py",
    "just had the workplace equivilent of a snow day happen",
    "\"No you are not required to attend this meeting\"",
    "while everyone is not here haha",
    "nossidge: :) yeah i was originally going to do that",
    "but thought it was a little too creepy",
    "nossidge: exactly you can do that too",
    "definitely that's the way to go.",
    "just name your branch something like um-join-page-changes",
    "are you using github.com or the console?",
    "git checkout -b um-join-page-changes master",
    "no problem, it looks like a good guide",
    "haha yep that would definitely be the case :P",
    "um hmm yeah i think you're right",
    "yeah git is difficult to get your head around",
    "*everyone* has a hard time with it at first",
    "kc: github is so nice though :P",
    "it may not be in the spirit of ~ but i mean",
    "im in the quotes db for something similar",
    "resulted in: god i hate jumblesale haha",
    "you should definitely be branching from master",
    "i think git is smart enough to work out that's ok",
    "and check that's the last commit you made to master",
    "then git checkout um-join-page-changes",
    "you might have wiped your changes",
    "OK nuke the dir and start again :P",
    "just nuke it all and git clone again",
    "i've defintely had git get into some weird states before",
    "this is why people hate technology",
    "oh right yeah. it was just a link to the ~ring join page",
    "but i mean, it was at the bottom",
    "im just about to deploy a pretty big project O_O",
    "i really do forget to breath when im stressed",
    "so a bunch of ssh-ing and some, i think it's svn commits",
    "i'll do it when im done, walk out, goto pub.",
    "it's looking good so far though :D",
    "that 1,333.3333 days worth of logs",
    "i honestly think there is a lot of potential here",
    "how is everybody's day/night/morning?",
    "been listening to more of your NOWERTBs",
    "XV is a total exestential crisis if i ever heard one",
    "the randomness in it all is part of the fun",
    "karlen: oh jeez, yeah, i can see that.",
    "karlen: why do you hate your accent?",
    "i think this is toally a cultural/local thing",
    "as an aussie you sound pretty much like any other brit :)",
    "ok well it just hit thursday here",
    "i might need to call it a night soon",
    "absolutely loved it though. so i have no excuse.",
    "not quite sci-fi but sort of is",
    "work day is starting. i have coffee.",
    "cut is the greatest command and everyone should learn it",
    "wow, 33 members now of the webright",
    "ugh not a good morning for typing",
    "each is good in its own situation",
    "cut is more for structured, delimited datasets",
    "i am actually surprised im not #1",
    "i talk a lot of crap on here :P",
    "looks like you got a ~ in there :P",
    "chmod a+r /home/karlen/reference/irc/#tildetown.log",
    "i dont have read access to your irc dir",
    "i thought directory listing was just +x",
    "im definitely in the town group",
    "was the file set to have the town group on it?",
    "i never see um about! he must be around whem im asleep haha",
    "i think jumblesale is keeping an irc log",
    "tail -f /home/jumblesale/irc/log",
    "adding that functions to .bashrc :)",
    "yeah karlen your format is much nicer. sorry jumblesale!",
    "karlen: heh, that theme looks familar!",
    "karlen: if you change theme that'll probably break :P",
    "my login is getting pretty our of control",
    "just piped chatty through lolcat too for added effect",
    "(he'll see that later im sure)",
    "so i have time to chill out :)",
    "oh snap i had an off-by-one error i think :P",
    "your next_item function is a lot cleaner",
    "yeah that looks great. merge when ready",
    "cammikebrown: the tilde.town webring :D",
    "cammikebrown: you do, but hold off for a second",
    "cammikebrown: um is going to push a few changes in",
    "i can if i knew how to use scrollback with mosh :P",
    "just shift+refresh to get the latest version",
    "oh man can you imagine if he added a !tweet in irc?",
    "haha I think it's an amazing idea",
    "i love seeing the random stuff @tildetown tweets",
    "tonight I am adding a wiki page",
    "to list everyones internall projects",
    "there's also nethack, crawl and angband installed",
    "they're shared with tilde.club",
    "um: you're the leader on ~karlen/bin/chatty",
    "ryan: yeah. your tilde.town shell account can be a VPN!",
    "ryan: oh right different tunnel than i was thinking of.",
    "zine library? portland sounds like a lot of fun.",
    "melbourne is the portland of australia I hear",
    "or to put it more exactly from a friend:",
    "I've actually never been to Perth",
    "joe: have you heard of sleepmakeswaves?",
    "I think you'd like them if you like Dirty Three",
    "bit heavier than dirty three, but in the same vein",
    "their older stuff is a bit more \"pure\" post-rock or whatever",
    "there is this post-rock pub i visit regularly :D",
    "yeah it gets really really hot",
    "those things hare fucking horrible",
    "but they just look scary as hell",
    "and I've been scarred as a child",
    "we're the worst going overseas and just making stuff up.",
    "joe: in some areas you're correct",
    "in the 80s though it was pretty much \"the look\" haha",
    "yep. i know exactly what you mean",
    "nah, just commenting on seeing people about the place :)",
    "but the ~town is where it's at anyways",
    "yeah it's a whole lot of red tape from what i understand",
    "jumblesale: i hope the remainder goes smoothly for you!",
    "any reason for melbourne in particular?",
    "khoi: append you new public key to ~/,ssh/authorized_keys",
    "haha karlen you got your shit so sorted mate",
    "karlen_work: np! go get your biology on!",
    "yeah there is a lot, spoiled for it really",
    "i new premier just got elected, which will be interesting",
    "no no this is just the state election",
    "abbot will definitely be a one term prime minister though",
    "just so you have a bit of a primer :)",
    "Labor won overall, so new state premier.",
    "Melbourne also has an east-west divite",
    "west = blue collar, east = white collar",
    "karlen codes on his phone like a chump",
    "i could be one of litterally dozens",
    "jumblesale: haha what the shit",
    "those look pretty horible in my terminal font",
    "it'd be getting on in the night over there right?",
    "oh wait i didnt put in the cmd line arg",
    "menchu dan has a couple more older entries",
    "just complaining about bash itself haha",
    "but was using crunchbang as my main desktop till recently",
    "but Xubuntu just works *so* well out of the box on my laptop",
    "i tried arch for about an hour",
    "always use debian or centos for servers though",
    "~town makes a good case for ubuntu servers",
    "with all the crap we're throwing at it :P",
    "it's the community version of red-hat",
    "all our servers here are centos",
    "the flow for redhat kinda goes",
    "that's a sign of a good server :)",
    "karlen: which log file are you using?",
    "haha official apple one circa 1990",
    "following all the ~town art links",
    "kc oh god my CPU just hit 100%",
    "nossidge: yeah your logo rocks (your whole ~ rocks actaully)",
    "robbymeals: yeah its really great.",
    "robbymeals: you cant but we know what you mean :P",
    "you can do it in HipChat if you've used that",
    "haha nup, afaik it's a atlassian thing",
    "i would *looove* quotebot to be linked to `tweet`",
    "whelp, my colleague just came up to me and handed me this:",
    "i have no way to get to the goods",
    "our whole CS department at university used 3 shared servers",
    "that *was* our workstation for the entireity of study",
    "emily: that's a really cool idea",
    "emily: running minecraft at the library",
    "just advertise it well outside :)",
    "it's super easy to set up a server too",
    "um_: you totally fixed bugs in my python code!",
    "um_: stop saying you \"dont know python\"",
    "haha i know what you're saying um_",
    "but in that case we all know no language",
    "um_: we're all making it up as we go :)",
    "however i'm more the infrastructure/sysadmin guy",
    "so programming is only about 20% of my work these days",
    "oh. does SQL count as a language?",
    "because i know more SQL that I would like to admit",
    "can query the crap out of databases",
    "in his absense, he is a PHD student i believe?",
    "do not do 6hrs sleep for 5 days straight",
    "pre paul ford email to waitinglist",
    "we have a git-based wiki you can clone and edit",
    "not blocked, i jsut dont have it",
    "\"A plugin is needed to display this content\"",
    "haha they're trying to ban uber-x in my city",
    "and uber has just been paying it for them",
    "yeah for a taxi driver you need to be registered",
    "ok, metro taxi licence is 22k AUD",
    "I had a Kangaroo burger last night",
    "red meat is not good for you in high doses.",
    "it's also one of the cheapest meats around too :)",
    "kc: you can do something like:",
    "tac <irc-logfile> | grep <username> | tweet",
    "you can also add -C <number> to grep",
    "to pull down surrounding lines",
    "tail -f /home/karlen/reference/irc/#tildetown.log",
    "kc: might wanna chmod g+xr that file :)",
    "if you're offering us to use it :)",
    "kc oh and chown kc:town sentiment.py",
    "everyone is in the town group by default",
    "kc: i think you forgot your #! at the top",
    "they are defintely percentages",
    "i have no clue what they represent :P",
    "happy friday from melbourne aus!",
    "amazing day... no just snap a pic and use imgur.com",
    "oh you guys wanna see the aussie ciggy packs?",
    "my english heritage is from up that way",
    "i hope friday postcards become a thing",
    "datagrok: very nice! love cali. been there a couple of times",
    "goddamn you UKers and ypur castles",
    "ok friends arriving have a good friday everyone!",
    "it's almost 1am... i just got back from a pub",
    "so yes... sleep is definitely on the cards shortly",
    "i have not seen you about -- new to ~town?",
    "i'll commit that to muscle memory",
    "yeah, what the hell does all that output mean?",
    "i didnt think php was installed here?",
    "~verse: making the internet less sucky",
    "~verse: making the internet fun again!",
    "yeah -- it's going to be tough",
    "anyone ruined vilmibm's night yet?",
    "whelp it's not quite saturday night yet over there",
    "I just tweeted our benevolent overlord",
    "i actually laughed out loud at that",
    "absolutely smahed people are good like that",
    "have you heard from him since?",
    "was this a colleague or a mate?",
    "but i've been weirder drunken situations",
    "karlen: holy crap you have a massive ~town twitter list!",
    "\u0001ACTION follow-spams karlens ~list\u0001",
    "ok well i have to get up and shake off this hangover",
    "probably doesn't want to get too high on chatty :P",
    "shit ok i gotta go, kc, karlen, see you later!",
    "yeah just got in. organising my day",
    "Sunday eve over in the motherland right?",
    "but i've only seen it i think twice",
    "Mon 15 Dec 2014 09:05:10 AM      karlen          dan",
    "i just typed world about 10 times",
    "and now the word world looks alien and weird",
    "im semi here :P sorry can't help with ruby atm",
    "pretty ok, crazy 24h in aus atm.",
    "nah all good. yeah don't know anyone in syd",
    "bit of a media shitstorm though",
    "oh yeah, i think that's global",
    "this week as been the most depressing week for news :(",
    "i just really just stop reading news",
    "audy: nope, but the wiki would be a good place to list them.",
    "did you both go out after the do?",
    "haha oh i can't wait to hear about it",
    "because that could potentially bring it down to a 6",
    "\u0001ACTION googles current time in london\u0001",
    "OK OK get to bed as soon as your boss GTFOs",
    "when is his wife coming to pick him up?",
    "well you have a solid 9-10 hours sleep potentially",
    "so that's good! drink like a litre of water",
    "drinks were had. beds were passed out in.",
    "oh well you've got an IOU then!",
    "you should go draw a penis on his face",
    "you should go draw a penis on his face",
    "coz some guy on the internet said so :P",
    "well he sounds like an alright boss anyways",
    "getting super drunk with you and all",
    "that's what you should be worrieda bout",
    "just don't let people walk on you i guess :P",
    "and don't (too willingly) take on other people's problems",
    "let me know what his wife does though",
    "i find this kinda thing hilarious personally haha!",
    "karlen: overall a good night though?",
    "YOU ARE NOW THE CAB DRIVER'S PROBLEM!",
    "i've done that before with freinds",
    "i think you might just be overthinking it",
    "that's indeed a peculiar situation :D",
    "ah i can sympathise with you there.",
    "ah alirhgt i have to go to the bed",
    "im not sure why you're beating on yourself about it :P",
    "i just have a really quick question then",
    "I am going to make a twine game myself",
    "after a d&d campaign I am playing :D",
    "jumblesale: did you get tweets working?",
    "i dabbled with trying to get a tweet bot going",
    "so it looks for 'Code' in your ~?",
    "i might have stolen the shrimper script :P",
    "haha just reading the newgroups now",
    "i still think a listing should be on wiki",
    "just so if stuff breaks or gets moved or *whatever*.",
    "hey jumblesale, thanks for aggregrating friday postcards",
    "but before the script was set up",
    "yeah ~audy would get more hits on .git repos for sure",
    "twine is such a nice medium :) makes me happy",
    "i already have a friday postcard :P",
    "it's attempting to upload to imgur",
    "\u0001ACTION starts a tilde.down bookmark folder\u0001",
    "nossidge: did you do all your ~ graphics?",
    "nossidge: they're really good!",
    "coaxial: but yeah milservers are an absolute PITA",
    "sorry, thank was for coaxial  :P",
    "fearlessbananas: yes i htink everyone does",
    "dan: it is the best analog of good window managers for osx",
    "the defaults seem nice on this",
    "just need to commit the key bindings to muscle memory",
    "im not sure when jumblesale's script runs",
    "awww permission denied to view others' crontabs",
    "kill your other mosh or screen or whatever",
    "then find the culprit and kill",
    "how did you boss situation go?!",
    "so your in-transit privacy is basically 0 with email",
    "so use GPG where possible (noone uses GPG though, so meh)",
    "the Date Updated: is out of date though!",
    "more talking Ableton, and external MIDI, low-latency setups.",
    "lol goddamn main hipchat channel at work",
    "at least when it's not being flooded with gifs",
    "ah that looks like a custom one there",
    "oh yeah ive got it hidden by default",
    "but who can resist clicking on gifs",
    "oh, it's a code for a thermostat in my room",
    "and i had to write it down somewhere in oreder not to forget",
    "probably not the same dan you are thinking of tho :P",
    "no, i just set up my username in irssi as 'dan'",
    "um: it lets you use ipad/iphone as a second display",
    "oh audy are you setting up your own ~ server?",
    "oh, a new haskell platform is finally out",
    "that's the list the JS references",
    "reppard: im adding that to my list of cool townie projects",
    "remotes.club is having shell problems",
    "oh there is a global list someone posted!",
    "remotes.club seems to be unique in that it's not a VPS",
    "ssh is probably on a non-standard port",
    "reppard: idk i kinda like remotes.club being red",
    "we used to do 'top races' in uni",
    "btw the new dislike club is up on radiotonic",
    "You'd almost be on my time zone atm",
    "now we can both jump on irc pissed as farts",
    "i assume? you there for work or pleasure?",
    "he loved it as far as i can tell though",
    "everything except other people apparently",
    "polite and curtious, but not really big talking to strangers",
    "could be said for a lot of places though",
    "the goddamn ignition cylender barrel thing seized up",
    "woo and work is letting me go early to pick it up",
    "but the process itself... yeah not my thing.",
    "i've set up a dresser before without an electric drill",
    "i promptly bought an electric drill",
    "\u0001ACTION discovered a word today\u0001",
    "wow im totally a knowledge worker",
    "(it broke down in a town an hour train from city)",
    "um: I very lazy morning I am having",
    "where was your user list again nossidge?",
    "i'm going to write it down this time :P",
    "we definitely do need to use the wiki more i think",
    "you could have a fully-fledged wiki CLI",
    "wiki --add-page \"Townie Resources\"",
    "i think the git client is fine",
    "i trust /etc/passwd over the front page :P",
    "my script basically skips anyone without a public_html",
    "make sure you have an EBS volume as your storage",
    "you can then plop that disk on a higher powered server",
    "for work, we do a bunch of EC2 stuff",
    "so i've had to do that exact thing once",
    "but i was actually upping disk space",
    "and it'll just fire up and work as it did before",
    "um: it costs almost 0 to learn on an ec2.micro",
    "we do have a perfectly good command line",
    "the console is like im sitting on my local machine :)",
    "but it's pretty quiet as is expected",
    "it's fairly minimal right now. irc and webpages.",
    "from when things were on tapes back in the tday",
    "but most files are tar'd then gzipped",
    "so you see the extension .tar.gz a lot",
    "will extract a GZipped tarball",
    "will extract a Bzipp'd tarball",
    "it takes a while to get those tar flags in muscle memory",
    "you can alternatively write them as",
    "tar -z -v -x -f something.tar.gz",
    "i find that truly hard to believe",
    "that's called a perk of parenting :P",
    "i just asked my workmate about his kids:",
    "yeah australian radio is pretty ok",
    "definitely a nugget of truth in there",
    "there isn't too much differnt from the US",
    "he does a lot of those news panel shows",
    "so yeah he is on TV quite a bit",
    "it looks good. has good reviews",
    "who throws a meeting at 5:15pm",
    "hi karlen! merry christmas eve to you too mate!",
    "but im definitely leaving earlllly today",
    "(i'll probably pop in here and there)",
    "woooh just had a really nice christmas potluck",
    "holy shit it's friday already D:",
    "kc: cool! what are you using to learn it?",
    "King's Bounty: The Legend; an old computer RPG",
    "Well, there are certainly high level type systems for OOP",
    "oh you are talking about Obj-C specifically, sorry"
  ],
  "datagrok": [
    "if i have allegiances, it's to my peers",
    "tilde.town has really become amazing though",
    "hopefully before all the android and ios devices go sentient"
  ],
  "dhgwilliam": [
    "AAAAAH SCROLLS IS RELEASED ON ANDROID",
    "audy: `crontab -l` should list your cronjobs",
    "and `crontab -e` should allow you to edit your cronjobs :)",
    "potasmic: you must be a bit west of HK",
    "has anyone read Emily St John Mandel's 'Station Eleven'",
    "-d1 = max depth of 1 directory",
    "it's hard to know w/out having root privs",
    "maybe it's R or the infocom language :)",
    "i'm guessing it's a bit warmer there too. later and warmer.",
    "my body is all messed up with time zones",
    "kc: we actually brought a blue light with us",
    "gotta keep an eye on those suckers",
    "morning (depending on where you are) \\o/",
    "and i'm p. excited by how easily and readily they seem to uh",
    "or it might just be Edna Piranha who is a powerhouse",
    "that doesn't sound that surprising, re complexity",
    "i bought a windows machine from a colleague",
    "still don't have any of the drivers i need :) / :(",
    "it's OSS, you could replace the auth portion i'm sure",
    "although the whole thing is in JS/node",
    "which a lot of people are also allergic to"
  ],
  "emily": [
    "how on earth is that easier on unix...?",
    "(like we are looking at running minecraft servers.)",
    "talking about *either* world of warcraft or minesweeper.)",
    "exits from irc certainly can be disconcertingly abrupt.",
    "i'd probably like seattle better if it were real!"
  ],
  "endorphant": [
    "but i have never worked with puppet before, so",
    "maybe puppet could look at a secondary user-generated file?",
    "i just put 'export TZ=\"(your timezone)\"' in my .profile",
    "'wait texas isn't in eastern standard time...'",
    "apparently it's snowing in denver!",
    "yeah, i'm flying to boston for new years :)",
    "i'm finally done with airports after thirty hours!"
  ],
  "fearlessbananas": [
    "i am surpised that it still works on modern browsers",
    "good evening, for all the europeans",
    "were you drinking/partying with him?"
  ],
  "frs": [
    "whoever noticed the hickup in addquotes.py, thanks",
    "also, um fixed it and tweaked the tweeting part as well",
    "rewrote the call so return values go to /dev/null"
  ],
  "imt": [
    "isn't anything harder like, I don't know, mindfuck?",
    "oh, the times I impliemented IRC protocol in VB",
    "vilmibm: how long does it take per user?",
    "ok, I'm really messed up with tmux panes now :)",
    "mornings jumblesale, karlen, anovak",
    "wouldn't be easier a json feed?",
    "hi, i was having my pre-christmas nap ;)",
    "merry <insert-your-season-holidays-here> to all of you",
    "papa: who's builiding a community?",
    "vilmibm: did you see my pokes about nntp?",
    "I guessed you were busy on holidays :)",
    "mmm, too many colors for me :D",
    "I've been thinking a lot precisely about TZ",
    "when is the system restart scheduled?",
    "I've got some bitcoins to mine :P",
    "3g on a bullet trai, not precisely the best latency I've had",
    "I'm striggling with fair resource sharing (login.defs)",
    "icmp_seq=769 ttl=244 time=19643.853 ms",
    "(i.e. 192.168.x.x. or 10.x.y.z)",
    "so what are you guys up to today?",
    "vilmibm: is that drink even legal?",
    "papa: have you read snow crash?",
    "\u0001ACTION knows #10, #5, #4, #3 and #2\u0001",
    "we'll roast a piggy and play some games to",
    "papa: don't you drink suntory?",
    "\u0001ACTION lurks 'cosmic encounter'\u0001",
    "marcus: krowbar[work] mentioned it, I don't know that game",
    "I'll bring 'citadels', 'san juan' and maybe 'munchkin'",
    "krowbar[work]: Bill Murray's standard!",
    "\u0001ACTION recently got Twilight Struggle ^_^\u0001",
    "I was told about Junta (or El Golpe)",
    "never played, but I'd love to :D",
    "papa, what do you want to achieve?",
    "/^[0-9a-f]$/ matches a single hex char (one and only one)",
    "which console games track highscores?",
    "been tinkering with mystic for a while"
  ],
  "inkoate": [
    "my 2015 language is going to be Julia, I think."
  ],
  "insom": [
    "I'm a fast reader, but I cheat."
  ],
  "ive": [
    "over here from tilde.red. yh thx man good 2 b here",
    "do i just type that into cmd line",
    "will check that out at some point",
    "how do i get to tha 'bring (thats cool new slang 4 webring)",
    "i have a few that i have made. oh cool thx",
    "i use it to write and format haiku",
    "i have a haiku garden on my tilde.red",
    "i'll probably just change to an iframe",
    "can anyone help me with a ruby thing?",
    "how do you do the shrimp thing?",
    "*mess with as in copy and build similar stuff",
    "the code is on his site as /logger.html"
  ],
  "jcouture": [
    "where is this repo at? I'm curious!"
  ],
  "jmml": [
    "you've done what you have been able to"
  ],
  "jneen": [
    "hm, i don't appear to have $TZ set..."
  ],
  "joe": [
    "and the weather's been shitty here in portland",
    "basically a tropical storm hit oregon",
    "@um: i just sent you a dm on twitter",
    "since we're friends and all :)",
    "although i hear australia is also nice",
    "one of my favorite bands is from perth",
    "arab strap and cat power and all that",
    "there are actually a lot of really badass postrock from AUS",
    "so i have a question for you dan",
    "is there a special name for them?",
    "because we get the Pineapple Express from the same area",
    "i was bitten by a brazilian wandering spider in 2010",
    "so i hate spiders across the board",
    "but that spider's bite is full of bacteria",
    "so i immediately developed a very serious infection",
    "and i think i didn't stop laughing all the way through it",
    "if you know him tell him i said hello",
    "it's more than one? my bloke is named chris",
    "there's a bodybuilder i'm sorta ok friends with named Con",
    "He's greek but totally Australian",
    "like australian in the most telling ways i guess",
    "i'm up for a quick chat before beddy bye",
    "child contemplative and reflective is what i do best",
    "it's not about what you \"think\"",
    "hardest lesson in learning to appreciate the moment",
    "don't overanalyze. just accept, be thankful, be at peace",
    "just accept being angry, or being sad",
    "and then, move on from that when you're ready",
    "DST does not make anything easier or better",
    "ugh here in oregon it makes it 3000x worse lol",
    "i wish i was as smart as you guys",
    "you guys are so smart and so talented at stuff like that",
    "i was sorta beating myself up for not knowing logic",
    "my depression makes me a mouthbreather",
    "i'm really trying hard to get this down",
    "and when i woke up i felt terrible about myself.",
    "i feel very lucky to know people on it irl",
    "thanks -- this was taken in outer portland toward dusk",
    "the caption means 'the night fog'",
    "@vilmbim my landlord works at the chinese garden here",
    "he can give you a tour for free",
    "you've been quite busy socializing tonight lol",
    "i'm looking for that lentil salad i was telling youa bout",
    "i remember making this salad in 5th grade",
    "how much does it cost for a domain name these days?",
    "i'm too content to go anywhere else",
    "i would love to say to my oppressors",
    "why don't YOU stop complaining",
    "stop making it about how things need to be all about you",
    "we have the power to topple it, to refuse it",
    "when we topple the empire of self",
    "the universe is inherently beautiful",
    "to accept this beauty is to accept the fulness of god",
    "i think i'm going to meet a husband on tilde.town",
    "i think i'm going to cuddle myself to sleep"
  ],
  "jonathon": [
    "Getting some nice rain here in Aus",
    "A nice change from the stinking heat.",
    "woops, jumblesale: houw about yourself? Up in that storm? ;)"
  ],
  "jseutter": [
    "I use it for my typing program",
    "\"It's like facebook, without likes.  Or graphics.\"",
    "heh, just showing my daughter what tilde.town is like :)",
    "man lolcat | lolcat -f | less -r",
    "heh, cool.  I just started watching Spaceballs",
    "never heard of that one.. looking",
    "pretty good, just watching some youtube before bed.  You?",
    "try: \"du -hs /home/um/*\" and \"du -hs /home/um/.??*\"",
    "no problem.  I didn't realize our quota was that low :)",
    "makes sense, I guess.  20 mb to a lot of users can get big",
    "someone has a username of whateva0x29a",
    "It must be one of the two you suspect",
    "Now she wants to make everything in lolcat",
    "heh, computers were one of the best bits of my childhood"
  ],
  "jumblesale": [
    "Didn't want it flooding the channel",
    "nossidge I'll look into that...",
    "next thing to do would be to rotate its logs",
    "is there always a space before the text of the message?",
    "I think it goes junkjunkjunk :message",
    "thanks for the help everyone :)",
    "so I can do scp ./* jumblesale@tilde.town:~/irc",
    "pwalck that's cool I didn't know about that",
    "pwalck what's the best way to make a script a daemon?",
    "I'd like to logrotate it or such",
    "hehe \"a few years\" feels like a good time to start worrying",
    "marcus yeah I love the bbs feeling of the place :)",
    "khoi just run it it's really straight forward :)",
    "marcus: stealth quoting, I like it",
    "~audy wrote it but I don't see it in his dir...",
    "yeah maybe tildezens is a wider term",
    "I want to do full screen refreshes like nethack though...",
    "pwalck any tips? I'm struggling to find anything",
    "learning Python has been such a pleasure",
    "so the alternative could be writing a custom client...",
    "god i don't even want to think about it",
    "alright I'm done for today. Have a great evening everyone",
    "I have heard the nhs's it isn't so great :)",
    "the privatisation - does it seem irreversible?",
    "today I am just at work working",
    "I'm kind of in holiday mode though it is going very slowly",
    "I write software, right now for crossrail",
    "building tunnels for the gravy trains",
    "pretty rudimentary internal reports stuff",
    "then the machines send this out in this weird data format",
    "we capture it, parse it and display it",
    "yes but it doesn't really address any of the problems",
    "if you wanted to try it out the server has node installed",
    "I saw a good simple irc bot kicking about",
    "it's a good one for playing about with , I think",
    "but I think python is friendlier :)",
    "like writing a diary with an idea of a reader who isn't you",
    "what are you working on klangspiel?",
    "let me know if I can contribute anything!",
    "haha you sound pretty neutral karlen :)",
    "the lo fi quality of the recordings really suits",
    "karlen how does the haiku system work right now?",
    "goodnight dan if you're not here when I get back!",
    "or you can just contribute one",
    "I mean, I think that would work ok",
    "wow /var/local/poetry/bin/mkpoem -t sonnet",
    "I wonder if the corpus is really small",
    "can't get this !haiku thing working though",
    "I think it's because the command takes a while to complete",
    "I think um is timing out or something :)",
    "didn't know about Quine just having a read up now...",
    "I quite like its absurd statements now though",
    "it was the blurst of times? you lousy monkeys",
    "I'll hook it up to the bot asap",
    "the first one I got was inauspicious",
    "Oh ÔÇô what's the bloody point?  /Kenneth Williams/",
    "multiple points of failure is definitely the future",
    "adding quotes isn't working for me :(",
    "cd to the quote script and it should work ok",
    "I'm hoping put together a poetry group thing next",
    "there's an example in quote_bot",
    "what language did you start with?",
    "so that's the same sort of area Quine was writing about?",
    "are you reading learn you a haskell?",
    "um that's really cool I'll check it out, thanks",
    "there's no hope for me then :)",
    "I'm glad to find someone else struggling with it",
    "I might start a ~ page to collect stuff about fp...",
    "yeah I cut my teeth on js back when I was quite young",
    "so the practical part of it has always been kind of obvious",
    "yeah, it's a beast that has no idea what it wants to be",
    "and like marcus says everyone wants it to be something else",
    "god the thing with state though",
    "it tries to modify the global state at every opportunity",
    "um me too. dart looks good but you jetison the js ecosystem",
    "yeah, imagine trying to trace js down to machine code",
    "there's a project for someone with mroe patience than me :)",
    "down each layer of the network stack...",
    "it's hard to believe it all works together",
    "ok um I'm interested in seeing how synapses work",
    "that sounds like a very narrow remit",
    "hopefully be back on this evening",
    "I realise my format's not very good for parsing",
    "ah I see yours already does that",
    "Let's just use your log as the canonical one",
    "which, in a geological sense, it was",
    "just a bunch of quotes from ex-conservative mp louise mensch",
    "yeah it collapsed pretty quickly didn't it?",
    "I don't know why it's different",
    "~karlen has written a couple of cool log parsing things",
    "I'll have nice logs for you later!",
    "I should probably do some work too",
    "jonno I'm in London! it's nice today, no frost, clear sky",
    "what were the books? I'll get them on the page at lunch",
    "great, I've got those bookmarked",
    "those tutorials are so easy to understand",
    "my understandign of categories is really weak",
    "I definitely need to bone up on the theory of this stuff",
    "so what would a concrete example of that be?",
    "so it's a function that maps functions",
    "I'm trying to get a visa to move there",
    "the application is a lot of effort",
    "yeah I'm sure it cuts both ways :)",
    "yeah apparently it's a great city to live in",
    "is it easy to get around withotu a car there?",
    "dan ok great that is a relief :)",
    "klangspiel can we see it yet? :)",
    "oh god hope my boss never gets a town account",
    "weren't there some welsh characters for a while?",
    "they ensorcelled little nephew with nes games?",
    "karlen-intermittant got to be honest that is pretty funny",
    "klangspiel awesome can't wait!",
    "it's kind of a functional programming joke I guess?",
    "yeah tilde town has killed my productivity",
    "I'm compiling a list of resources on my ~",
    "cool I'll let you know when the page is up :)",
    "karlen what will you do when you're placement is over?",
    "oh cool what is your research?",
    "it gives me mentions for jumblesale",
    "nope nothing for jumblesale|work",
    "I guess I would expect it to only do it for my $USER",
    "is it because | is a special character?",
    "we could use Ôÿâ instead of | for delimiting?",
    "then you'd only have a problem if I did this",
    "oh no! /nick won't accept the character :)",
    "who could have put that there :|",
    "karlen I may have to change up trhe log format a bit",
    "I think generally we should do HH:MM\\tnick\\t| $msg",
    "now the problem of marrying the two timestamps",
    "no hang on that defeats the purpose...",
    "the \\t will hopefully make it easy to parse",
    "--- Day changed Wed Dec 10 2014",
    "only just saw that in the log, it's messing with my regex",
    "ok karlen I've got your logs parsing",
    "what is your presentation about?",
    "so you're changing what you're working on",
    "karlen[work] bonus: we can now export .txt and .json",
    "well I split all the bits out during the parsing step",
    "we should be able to do all kinds of stuff with them :)",
    "karlen[work] I'll set up a log dir",
    "karlen[work] I can't cope with /actions",
    "it's coming out in my log as this character:",
    "I'll figure it out later though, have a great evening :)",
    "what's that yellow thing in the sky in that photo?",
    "happy friday dan :) exciting weekend ahead?",
    "huh smoking causes mouth cancer how about that",
    "it turned out to be a massive bother :)",
    "karlen that's cool it is an historic uni isn't it?",
    "datagrok let's see your view! :)",
    "the url spoils the surprise a little",
    "datagrok haha! you're working late",
    "huh I assumed it would be older",
    "karlen wow you had a castle right there!",
    "karlen this thing is forcing me to learn date times",
    "we let members of the commonwealth use it",
    "every leap day a little extra escapes",
    "if I were better read I would have made a nietzsche joke",
    "tbh I'm happy with this reality",
    "do we agree that yoru log started on the 9th?",
    "ok it detects date changes, soooo clooooooooose",
    "which I think is kind of standard?",
    "a bunch of times I was like \"this is not worth it\"",
    "then we can stick it in the bot",
    "I'll get some time this weekend to refactor hi,",
    "that's the script that did it in the end",
    "it looks like a school kid's programmign assignment",
    "it's done its job now I can kill it",
    "can't parse that file any more :)",
    "it would be a miracle if it stayed upright on the launch pad",
    "spectators woudl weep to see it",
    "if not then I will be really upset",
    "I'll set up proper log -> json this weekend",
    "but there's an example available now",
    "doesn't seem to do it for me either",
    "I have a suspicion it's not parsing the nick right",
    "then it tries to /msg it to you",
    "yeah that's where I will store them I think",
    "which I guess means chatty is only for a 24 hour period? hmm",
    "we can just keep it all in one file",
    "but then mentions will give you loads of results",
    "images - auto-generated page of the images linked to in irc",
    "louise bot - tweets spiteful convservative rhetoric",
    "/home/karlen/bin/mensch \"#tag\"",
    "jumblesale@tilde:~/irc$ /home/karlen/bin/mensch \"#fact\"",
    "1418296800 karlen wales is from the distant past #fact",
    "nossidge|AFKish I think it's configurable",
    "all you'd need to do is modify the formatter",
    "yeah well the old log was a massive mess :)",
    "and it all happened because ~frs built the quote script",
    "my git scripts are known as the dino scripts",
    "#not sure what this is doing here",
    "doign all that in bash / sed / awk is really impressive",
    "I can't get my head around those tools",
    "would rather just brute force it in js or python",
    "the whole frontend js thing is a nightmare",
    "could we have irc bots debating each other?",
    "I think they'd find a common ground pretty quickly",
    "so that should work now right?",
    "mensch \"#fridaypostcard\" should work ok too I think?",
    "can you tag the other ones we got? yours and dan's?",
    "I'll throw together an html generator",
    "or if we retag the ones from earlier that should work too",
    "really rough but it seems to work!",
    "nossidge it's cool just nice to have stuff on there :)",
    "it's cool it can work with both now",
    "I leave it as an exercise for the reader :)",
    "are you have a leaving celebration?",
    "I think wilkos might be the last bastion",
    "a lot of pic n mix or like one pen",
    "there's not a thing they can do to stop me!",
    "hehe you should autocorrect toy -> you just in case",
    "it is bizarre they're still going",
    "especially after woolworths collapsed",
    "alright I've got a wedding to go to",
    "have a great evening / weekend",
    "hey nossidge how are you doing?",
    "yeah the wedding was a lot of fun!",
    "haha it was very hastily arranged so unfortunately not",
    "I would choose Python I think it is a much nicer language",
    "that's way more extensible than my script :)",
    "yeah we could have a tweet script",
    "yeah that would be good to have",
    "hehe yeah that's already in there :)",
    "there's a setting in git to auto convert",
    "oh yeah you could do some nasty stuff with that",
    "not slow, just really easy to find collisions",
    "so not worth anything as a cryptographic function",
    "yeah sha 256 should be fine :)",
    "got to go but will check it out later",
    "woops, just killed every terminal I had open",
    "apparently by pasting too much text into vim :)",
    "I'm ok, just got into work which is a lot less good",
    "only one week left until I go away",
    "I'm going to zanzibar for christmas",
    "cmr I saw that too and thought of tilde town!",
    "we could do something with curses or something?",
    "I didn't know about those, thanks cmr",
    "youtube movies in the terminal!",
    "we should definitely have some ascii movies for tilde town",
    "I'm going to update fp in a bit",
    "yeah boatmurdered was great :)",
    "tilde town succession game anyone?",
    "how do you define the timespan you have control for?",
    "for things to go horribly wrong",
    "what's the animal on the front?",
    "it's the interface that makes that a pain though",
    "I can't believe anyone plays with dwarf therapist",
    "I've seen some insane projects with that 3D viewer",
    "and a newsgroup post to encourage others to join",
    "karlen khoi will you guys do a year too?",
    "thanks so much for -fp makes it so much easier",
    "also i put some stylings on the page to make it fancy",
    "/home/karlen/bin/menopt -s jumblesale -h 24",
    "if I pass -s it seems to also include stuff I've said",
    "what's the flag for things people said about you?",
    "/home/karlen/bin/menopt jumblesale",
    "cat: .mensch-temp: No such file or directory",
    "-z doesn't seem to make a difference though...",
    "/home/karlen/bin/menopt -u jumblesale -h 1 -z +0",
    "ok I'm going to make the switch on the bot",
    "Krowbar alpine, then just mail whoever@tilde.town",
    "it's cool, now it does everything we need",
    "karlen this is so cool. thanks for all the work on mensch",
    "khoi dwarf fortress succession :)",
    "like the format of the thing it's consuming &c",
    "in what way deprecated karlen?",
    "bash is like the unix ur language surely",
    "I can't even remember the syntax for the most basic things",
    "I guess if it works is a really important criteria :)",
    "maybe not for haskell but for bash or something?",
    "only another 50 messages and I'll have toppled dan",
    "I tried emailing you but it won't send",
    "I think maybe because of the capital k?",
    "this is sort of what I wanted to build...",
    "yeah fp uses the new version :)",
    "I hope someone submits a postcard for Friday!",
    "also maxmister would be a great name to have",
    "I'm sure it will be fine then :)",
    "marcus that's cool, what sort of stuff will you make?",
    "it all just ends up in one html file",
    "lodash is great, adds a lot of functional features",
    "it's just a way to make text adventures",
    "I thought tilde.town could just throw ideas at it",
    "krowbar that sounds like an amazing book",
    "could be an interesting project",
    "the example program is nibbles :)",
    "also it would be super easy to host the results",
    "we can preserve state with custom js",
    "i might add that as the first little thing",
    "I have an evening off so excited to make a start on it",
    "alright I'm off home, be back on in a bit",
    "I just realised I could host it like that!",
    "I just sat down to write the starter",
    "Krowbar cool, I will set up a repo on gh for it",
    "yeah if you crontab -e it'll ccreate one in your ~",
    "that's how fridaypostcard is running",
    "oh nick! glad you got it! it was a fun puzzle :)",
    "nick I nicked it off an online tutorial :)",
    "the irc protocol is dead simple though",
    "and then karlen built a load of cool tools on top of the bot",
    "so now we have !quote !mentions !chatty etc",
    "nick pr it and I'll merge it in!",
    "krowbar I'm making some headway with this twine :)",
    "it's clear it is the best of the tags",
    "I can email you about df and twine now :)",
    "krowbar that was my first passage :)",
    "god getting kind of carried away with this",
    "inkoate I think it has a message in the log > 512 bytes",
    "going to have to investigate tomorrow",
    "I can just limit the amount of characters it sends",
    "dan it has been pretty rubbish yeah",
    "selfsame good to finally run into you on irc :)",
    "that stuff with the command parsing looks amazing too",
    "so I thought I would fork and experiment",
    "selfsame it's not running right now is it?",
    "unfortunately I'm going to have to head off right now",
    "struggling a bit with this week",
    "yeah just can't wait to get out of here",
    "are you going in to work today?",
    "yeah fine so far! no drunken bosses in my bed :)",
    "dan is always just ahead of me!",
    "what programming languages are you looking at?",
    "fearlessbananas that looks like a handy script!",
    "kalen it actually was one of your messages :)",
    "always trying to sabotage quote_bot!",
    "my ~ is a massive web of symbolic links",
    "karlen you should put mensch on there",
    "all I did was mkdir Code then ln -s the repos in",
    "fearlessbananas mensch is what powers the !mentions command",
    "it's the way we get stuff out of the irc log",
    "you can check it out at ~karlen/bin/mensch",
    "the important thing is I'm above dan",
    "I always thought it was kind of ridiculous",
    "I missed rome, didn't get into the series until medieval 2",
    "yeah I'm saving up for a new computer too",
    "that is a better way to spend the money I think :)",
    "we're hoping to do japan + korea next summer",
    "it's cool, it does everything it needs",
    "you could call it plan -9 from outer space :)",
    "alright karlen have a good lunch",
    "I wrote the twine in 1.x format and 2 is totally different",
    "ok quote_bot should be resilient now",
    "dan not me, khoi has done them",
    "are you building something atm?",
    "dan that sounds cool you should do it!",
    "great it should update in ~ 20 minutes",
    "make sure you submit one for friday :)",
    "dan that's what inspired it :)",
    "krowbar I'm not really here but I just sent you an email!",
    "update your public_html/index.html!",
    "there are some other projects people are working on",
    "I'm trying to get people to contribute to a twine game",
    "I'm going to write up a guide today",
    "I'm ok, penultimate day of drudgery",
    "you need to buy very small gifts",
    "space and warrior intros are done",
    "karlen I'm off after next week as well :(",
    "got to get some coffee need it so bad",
    "how do you determine if two words rhyme?",
    "nossidge can we get that as a friday postcard?",
    "is there some way of knowing when new ones are up?",
    "that's really cool that you can post them so regularly",
    "and rss feed would be cool, yeah",
    "always astonished how much you do with bash :)",
    "karlen that's ok, I can just do it manually once a week :)",
    "a bunch of people are using ~audy's code thing now",
    "I can't see why it wouldn't honour the - though",
    "no way is - in the \\w character class",
    "(.*?) should do the same job and include -s",
    "unfortunately it's ruby not bash :)",
    "tempt him with some delicious dried fish skins",
    "what kind of fish do you have?",
    "siamese fighter fish look amazing!",
    "man I always wanted some tropical fish",
    "we had some goldfish and three koi",
    "the koi got too big for the tank so we sold them",
    "then we just had these ancient, boring as hell goldfish",
    "we gave them to our friend who had a pond",
    "it was all scabby and its fin was broken",
    "yeah this guy had leaped out of his tank a few times",
    "wife got home to see him sat on the floor all sad looking",
    "couple of weeks later he was back to normal",
    "love butterfly houses and koi ponds :)",
    "but you're right they are so dull",
    "I am going to a butterfly centre next week",
    "I went to the one near angkor wat and it was amazing",
    "oh you should go, it is the most amazing place",
    "but also make sure to go to the butterfly sanctuary",
    "I don't think ours had any real personality...",
    "you couldn't really tell them apart",
    "probably we were just bad fish owners",
    "they didn't get much attention",
    "I should really walk him some time...",
    "we have a small flat and a small dog and it works out ok",
    "like maybe a pug, best of all the dogs?",
    "just the friendliest little guy",
    "oh man shiba inus are just the most handsome dogs",
    "so everyone can just maintain their own files",
    "pugs use their brains for mischief :(",
    "that's a surprisingly accurate description",
    "all victorian dialogue starts \"I do say\"",
    "then if you come for it he'll just run around like an idiot",
    "ah sorry that is really upsetting",
    "exciting news on the twine front",
    "so anyone can contribute to the story :)",
    "check it out in ~jumblesale/twine",
    "with the data in ~jumblesale/ttitt",
    "look at how for instance it sets names in the current story",
    "nope you can do some pretty complicated stuff",
    "and kind of progress towards something or another",
    "so \"jumblesale.space hero\" or whatever",
    "I'm really excited to see what we can do :)",
    "in the vein of colossal cave :)",
    "so it could have all different areas branching off",
    "marcus you need to make the directory ttitt in your ~",
    "then fill it with a valid .twee",
    "you can make those in a bunch of different ways",
    "I'm going to write it up later",
    "it's not on cron yet, I'll set it up",
    "you'd have to change the syntax",
    "unfortunately we're on 1.x not 2",
    "glad to see people getting on board with this!",
    "you can choose to use it or ignore it",
    "that sounds ok though for a rough overarching thing though?",
    "I can help if you like nossidge",
    "I did quite a bit of it on Tuesday",
    "I don't like that so much but if you really want to go ahead",
    "there is a linux version of the app",
    "or you can hand-write the .twee",
    "I'm having problems with the script right now...",
    "krowbar can you do me a favour and just empty your .twee?",
    ":: Start needs to be in base...",
    "your first passage should be user.start",
    "oh no hang on.start is a rubbish convention",
    "I'm still having problems with it",
    "sounds like that would be a pain to test",
    "then everything should more or less work...",
    "someone had a page on doing that I think?",
    "thanks marcus looks like this should work",
    "thanks datagrok! thought I had seen it somewhere :)",
    "so the start passage will be krowbar-start",
    "nossidge I'm just about to write it up",
    "if you export the .twee from the desktop version",
    "upload it to ~nossidge/ttitt/whatever.twee",
    "then it'll get automatically included",
    "otherwise it will overwrite the start page :)",
    "remember you can multiple .twees",
    "nossidge great! let's try importing that...",
    "we should probably namespace macros etc.",
    "although the inventory one should be global",
    "user-name would be good I think",
    "yeah same as with the start passage",
    "nossidge could you try running ~jumblesale/twine/build.py?",
    "if you could try again that would be great",
    "yeah but then it fails to write to base.twee and index.html",
    "I guess I could make them writable. they are data...",
    "ok now anyone can run build.py to update the twine",
    "I'll be back later to write it up",
    "looking to seeing what everyone comes up with :)",
    "couldn't figure it out so just bodged it",
    "nossidge that is really cool! how did you do that??",
    "the muddy, sticky, smelly floor thing?",
    "could we display it on every page?",
    "I don't have one yet, must sort something out",
    "did you see we have the twine game working?",
    "do you have a photo of it for friday postcard? :)",
    "which I will kick off right now",
    "vilmibm I'm glad :) do you have a postcard to add?",
    "just working through emails...",
    "krowbar did some amazing stuff on the twine last night",
    "no! nobody's too late! it's all fine!",
    "and you're all beautiful for contributing",
    "um oh yeah? still need time to put all those links together!",
    "nossidge ok I'll look into that",
    "nossidge check it out in ~jumblesale/twine/build.py",
    "I thought I had but maybe not!",
    "wow this morning is a time for wonderful things to happen",
    "karlen yeah my commit history has shot up since I joined :)",
    "karlen so up for a meetup! (in london)",
    "someone on the tube this morning was playing pokemon blue",
    "what like geo local matchmaking?",
    "um let me know and I'll pull from you",
    "fearlessbananas thanks!! updates every 2 minutes",
    "fearlessbananas are you secretly dan?",
    "because you're not ircing locally",
    "you're ~dan on your local machine, right?",
    "either do \\#channel or \"#channel\"",
    "# is being interpreted as a comment",
    "yeah I'm sure people experience all that really differently",
    "nobody really understands sleep",
    "saw richard wiseman do a fascinating talk on it",
    "I guess because he has a book out on the subject",
    "so it reinforces learning during the day, aids muscle growth",
    "ends up just making you say whatever",
    "quote_bot I'm disappointed in you",
    "taking my frustrations out on quote_bot",
    "he didn't do anything to deserve that",
    "what gendered pronouns should we use for bots?",
    "alright guys don't inflate its ego",
    "nope fearlessbananas has his irc username set to \"dan\"",
    "and we parse out the username not the nick",
    "maybe we could start an online petition or such",
    "those are usually so effective",
    "mensch is working beautifully :)",
    "um you said you were a secular jew? was it a jewish wedding?",
    "I like it because it sounds so mild",
    "but the manual mode was super easy!",
    "nowertb would be a good use for it",
    "is it greedy? that seems like it shouldn't work...",
    "oh my god it is aggressively cold out there",
    "karlen get out. you're banned from tilde.town",
    "um keep going I don't think anyone minds :)",
    "like a pith helmet would not look out of place",
    "yeah christmas in zanzibar with my wife",
    "haha no she's from somerset :)",
    "hopefully 2015 is going to have a lot of travelling in it",
    "final bit is to do os.popen(\"tweet %s\" % text)",
    "karlen I'd forgotten that. it is amazing",
    "krowbar why do you need the :: Start passage?",
    "um I'll add you, what's your gh account?",
    "krowbar how do you build it usually?",
    "forking is the github way of doing it",
    "um I think you should send quote_bot's inaugural tweet",
    "cool thanks so much for the addition um!",
    "krowbar any luck? anything I can do to help?",
    "nossidge can we use this as a corpus for poetry?",
    "line 1272 onwards is a real tweet",
    "karlen sonicwisdom.sh to go in your .bashrc! yes!",
    "/home/jumblesale/sonicwisdom.sh",
    "krowbar I'll see if I can work something out...",
    "don't want to cause you undue problems",
    "nossidge that's way faster, thanks!",
    "yeah we should think about this...",
    "karlen have an amazing time in japan!!",
    "hope you guys have a great christmas",
    "thanks! I'll probably see you in the new year",
    "ah I might have some time when I get home...",
    "krowbar can you try building again?",
    "nossidge I'll merge the info stuff",
    "I can auto-generate the users too which will be nice",
    "and then I'll fold that into the base.twee :: Start passage",
    "yeah I thought that was the case",
    "krowbar what do you need to appear in the :: Start passage?",
    "so those have to get set before anything else?",
    "yeha ok I agree the former is more permissive",
    "also nossidge it produces StoryAuthor automatically",
    "9 minutes until I leave for the year",
    "none of those are numberwang :(",
    "have an amazing evening everyone",
    "hey everyone where are your friday postcards?",
    "alright I'm out, have a great day everyone!"
  ],
  "karlen": [
    "rain: I choose Yo yo yo yippy yo yippy yay",
    "oh god, just found some old band recordings. The feels",
    "they were talking about it the other day",
    "ah that makes sense, I tried it but without the botname",
    "how do you see who requested quotes?",
    "haha well you have done a lot better than I have",
    "apart from a higher calibre of conversation",
    "i was trying to get the weed theme for irc working",
    "its so pretty, not much luck though",
    "ah cheers datagrok that hit the spot",
    "just playing with irc config stuff",
    "how is the groking data going datagrok ?",
    "fair enough, it is a bit more rational",
    "What are you doing with it klangspiel? Really want one",
    "love my RPI but would like to do something with hardware",
    "ah no it was your nick, used krowbar",
    "yeah just looking through the code now",
    "haha you don't have to justify anything. I think its neat",
    "but i certainly don't eat them",
    "fish law is not governed by reason",
    "elflord is nice enough not to offend me",
    "haha rain I swear you have an irc alert for mosh",
    "I feel bad now rain! its a good thing",
    "rain: do you work at MIT / on mosh?",
    "luckily my hair grows so quickly it wont last long",
    "are you going to build a snowman?",
    "dan: maybe you could make it out of office stationary",
    "hahaha oh my, did you just make that?",
    "please hide that somewhere on your page",
    "have fun dan, night rain and kc",
    "think virgin have already made moves into cancer research",
    "sorry not researcg, i meant hospitals",
    "what are you up to today jumblesale ?",
    "is there a new version a la python",
    "we need more quotes in quote_bot",
    "sure you could put a couple in",
    "thinking about it, probably more even",
    "ill get off irc if thats what you want",
    "did you make any more snowmen?",
    "im loving the udea klangspiel. seems perfect for here",
    "thanks jumblesale thats really kind.",
    "jumblesale: that would be really cool!",
    "ive got a bpok of basho i could type up?",
    "i am really bad for obscure reference",
    "oh was it from embassytown on my twitter?",
    "dan id def check out city if ypu have a chance",
    "yeah its hard to get iff irc :(",
    "nice one nossidge, does it only recognise full names though?",
    "hahaha the knock knocks are hilarious",
    "hey um! haven't see you around for a while!",
    "haha really? crazy! Guess it has. Feels longer",
    "or is more of an internet thing?",
    "yum just ate two scotch eggs. No regrets",
    "Yeah I am going out a week friday",
    "haven't seen her in months obviously so can't wait",
    "hard to be lifestyle partners thousands of miles away!",
    "um whats up with the ring? does the html need updating?",
    "no! just know you have been working on it",
    "wondered if it was all back end",
    "for instance there is a \"next user\" thing now it seems",
    "ah cool, ill leave it for now then?",
    "or just one change in the line",
    "I click through a lot of the links to just see 404 etc",
    "yeah! i noticed it was working",
    "haha that sucks um punished for your name",
    "no um but I shall check out oput",
    "haha no, that would entirely defeat the purpose",
    "because that one does a lot of the tildeverse",
    "haven't even heard of most of those",
    "but still on tilde and irc haha",
    "not bad, I miss coffee in the evenings",
    "I like cut but its a silly stupid, sed is the one",
    "sorry, I mean unintelligent. Sounds like I was being rude",
    "I normally work with crappy output so sed is better",
    "just looked at the homepage but its a login, whats the deal?",
    "just made a quick bash two liner",
    "ah that sounds like a clever idea, will have to look into it",
    "could you try running ~karlen/bin/chatty",
    "yeah, standard nonsense. try again please?",
    "oh weird, i set the group to read",
    "this teaches me for locking down permissions",
    "weird, as i thought you were already in my gang",
    "since roughly 24 hours ago you have spoken that much in irc",
    "well its not every 24 hours, that just where my log begins",
    "could of used his though and not had permission agro",
    "would it be useful to have a rolling 24 hour top ten?",
    "that chatty script is literally one line",
    "i should change it to jumblesales though as it is older",
    "although i could strip up to : and after ! easily enough",
    "can always add more sed arguements",
    "yeah i will be keeping it going",
    "just working on jumblesales but its such a nightmare to sed",
    "haha you know its reefer madness",
    "think its saved even if the box goes down again",
    "im still hacking away at jumble out of spite now though",
    "nice dan, added those additions",
    "dan is massively leaving us hanging though",
    "to the end of that function to remove nick changes",
    "even if it is just one line of bash",
    "whats going on with your login dan?",
    "on login? wont that be super slow?",
    "is this the beginning of a snowball poem nossidge ?",
    "mail -e it was! added to .profile",
    "it will only be an issue if a user called quote turns up",
    "nossidge: some good ones in there I will steal. I like",
    "haha now you have us intrigued kc",
    "anyways, time for me to hit the hay",
    "Haha i never sleep well but thanks",
    "haha feel free but it is not impressive",
    "well it doesn't go back 24 hours but the log has timestamps",
    "its ok um , i was just babbling about sed",
    "haha I told him he needs to mosh",
    "yeah either that or just carry on using yours jumblesale",
    "could one of you guys run ~karlen/mensch",
    "did it give you your mensch jumblesale ?",
    "hahaha I forgot you would recognise that",
    "her social network didn't last long.",
    "it gives you what you say? interesting, doesnt for me",
    "ie not including your fine self",
    "hey dan jonathon is from brisbane, australia friends!",
    "did you join the aus tilde in the end?",
    "aint no party like a tilde town party",
    "sure there must be equivalents for all phone OS",
    "haha but with the box too please",
    "ah sounds like a clever catch there klangspiel",
    "last one I promise, but can someone say my name as it is",
    "haha jumblesale it would be an honour if it is robust enough",
    "my testing is obviously fairly limited",
    "on the internet no one knows you are a dog avoiding work",
    "yeah it was very odd, ill find the link later",
    "haha I still giggle like a girl when I type in :Sex in vim",
    "wales is from the distant past #fact",
    "love that quote bot is in the top 10",
    "i do not understand that quote at all",
    "jumblesale|work: sounds good, id love to learn it",
    "jumblesale|work: does mensch work with your current nick?",
    "including the last couple I said?",
    "could you say my current name jumblesale|work",
    "haha I have a lot of problems with that solution",
    "weird, I didn't get a day change",
    "its all about ethics in bash script writing",
    "its my favourite phrase in real life but no one gets it",
    "haha you got some mansplaining?",
    "think i got the idea from tumblr.com from xkcd",
    "its good then? never played it",
    "it can be in there going forwards",
    "haha schools not out for storms apparently. Bad luck",
    "the IRC logs will be mighty now",
    "should be easy to rewrite mensch and chatty",
    "unless you are doing another mention thing?",
    "hmm I worry I have been treading on your programming toes",
    "sense as in demonstrated ownership",
    "can you grep out lines that begin * |",
    "or whatever the new delimiter is?",
    "i cant even see the character after your :",
    "you mean using my mensch or my log?",
    "hmm that is odd. control characters are a real pain",
    "or at least I think I have haha",
    "are you marcus? what are you going to do with them?",
    "what are you going to use as search criteria?",
    "what are you going to do when you find them?",
    "have fun marcus, let me know how you get on in your search",
    "whoop there it Ôöù(´╝¥0´╝¥)Ôöô",
    "gah, need sugar for tea, but mynadd leaving the house",
    "green / black won't hit the spot",
    "they look horrible everywhere id bet",
    "um has the worst possible name to parse",
    "yeah, but the nicks come into play",
    "ie $USER-foo $USER_foo $USER[f00]",
    "run ~karlen/bin/mensch for me if you get a chance?",
    "does it look similar to ~karlen/bin/menshu dan",
    "but I dont think um can use mensch it is current state",
    "yeah its clever! the code is now a lot nicer",
    "pcpartpicker has a poor history on their website",
    "haha to be fair I could probably be much more elegant",
    "getting epic login profiles etc",
    "but I suppose all are like that",
    "not really done anything with centos",
    "actually my cluster at work might be centos",
    "oh its scientific linux, that makes sense",
    "i reckon I have typed your name about 50000 times today um",
    "and not because I was being slightly more indecisive",
    "I am working on a mention parser for the log",
    "well um is not too bad but with the nicks too",
    "um could you try running \"~karlen/bin/menschu um\"",
    "at which point my scripts become redundant",
    "nick-foo nick_foo nick[f00] nick|foo",
    "vim ~karlen/reference/irc/#tildetown.log",
    "I love um as a name, plus it is just a trivial thing.",
    "the new logs will be harder better faster stronger",
    "dan you are number 1 on chatty!",
    "oh what did you think of them um?",
    "haha thats the only apple watch i want",
    "mellow late night tune for me here",
    "um have you seen ~nossidge's tilde png? youd like it",
    "yeah there is some great stuff appearing",
    "also dan I stole your idea, as I do many of your ideas",
    "i have seen that before kc, its cool!",
    "well there is one in particuarly coming up",
    "what would be a better phrase?",
    "at the beginning of the track?",
    "yeah I want it to be as little of me as possible",
    "i like it kc! much easier to follow",
    "x axis could be a little clearer thoiugh",
    "the tilde and cross are amazing",
    "i like not being able to edit after writing",
    "get some sweet 1.44mb of action on that dan",
    "yeah that must be really titilating",
    "ie is it windows vs unix or just server vs no server",
    "he will be back, and in greater numbers",
    "he really needs to learn how to mosh",
    "you are in the bay area emily ?",
    "The only thing I know about seattle is fraiser",
    "which makes sense as it sounds insane to me",
    "haha fair! I love doing accents and I am not bad at a couple",
    "hes from Philly via California so it is odd",
    "ums talking silly buggers again dan[work]",
    "both begin with the same letter",
    "got my seoul256 set to background 234 btw dan",
    "did you set a passphrase when you created the key?",
    "its quite simple, if you enter \"crontab -e\" into the shell",
    "then add a line that looks like this",
    "i have about 5 keys so I need the hack",
    "outnumbering TEAM USA and the Aussie",
    "dan[pub]? this could get interesting",
    "think I fixed the mensch thing",
    "gah, that does look horrible dan[pub]",
    "no worries jumblesale|work it is a big task",
    "actually its the grim north that is Manchester",
    "ah really? My heritage is from London haha",
    "well London, Wales and Poland I think",
    "thats a more interesting view jumblesale|work",
    "ah thought it might have been jumblesale|work",
    "so that now lives under the desk",
    "all open offices which everyone moans about",
    "luckily I am cordoned off with the computer nerds",
    "haha dan started it but I think its fun!",
    "looking it up now, Oxford est <1167",
    "a tiny welsh village from the distant past",
    "don't think I could afford it though :(",
    "although thats not the reason Im here.",
    "its all locked up in the observatory",
    "just a tad, to keep them happy",
    "its no wonder the timelord is always british",
    "if i were better id have understood it",
    "if it does the job thats more than enough.",
    "you have done an amazing job with that jumblesale",
    "three cheers for jumblesale|work",
    "it looks good to me! it clearly works very well!",
    "haha but it still got us where we needed to be",
    "haha no I am super happy you did this",
    "jumblesale|work: does this log cover my log period as well?",
    "jumble you beautiful human being",
    "it was so simple to parse that",
    "i took ten mins when it wasn't needed",
    "ok jumblesale, try running the following",
    "~karlen/bin/menschneue jumblesale",
    "well i have renamed the files now but you can work it out",
    "which means you can spy on people too I guess",
    "where does it send you the messges?",
    "i have a strange irssi layout though",
    "might be stopping it spawning? private message me?",
    "should be backwards compatible",
    "so people could request last 10 mentions or whatever",
    "closed all my windows and will try again",
    "ok it doesnt work when im in nick",
    "yeah works perfect when I am nickless",
    "so they are not in ~jumblesale/irc/logs/*",
    "the first would be very easy with a regex",
    "they would only be slight extension to chatty",
    "or louise maybe as weve been working together a while now",
    "images could easily be done on a range if suffix plus imgur",
    "haha there we go! thats an unexpected free be",
    "however the hell you spell that word",
    "ill work on the image regex later",
    "think that covers everything? well except !chatty",
    "love it, thanks again jumblesale",
    "yes! love tilde town for the layers upon layers",
    "its the one i use to push all changes before I go home",
    "so its hometime when the nyancat appears",
    "thats cute! starred as looked interesting",
    "fitting nick there nossidge|01234567890",
    "plus I love how platform agnostic bash is",
    "as long as its unix ish youll be alright",
    "so found a way to write an ugly version for IE",
    "weird when people reply to your tweets",
    "I certainly hope I never have to talk to them!!",
    "haha just like tilde town irc if I had my way",
    "i am a simple man with simple tastes",
    "and those tastes are for robotic alloys",
    "someone should make a post on #fridaypostcards or something",
    "they wouldnt past the turing test",
    "slightly nicer view than my one earlier",
    "also glad i dont have to panic about closing my urc log now",
    "does it use mensch or do you just grep out?",
    "I should probably just look at the source",
    "nice bit of pipework there jumblesale",
    "oh I should have sent the photo on its own",
    "makes sense, I'll do that next time",
    "really good idea to turn into HTML !",
    "just had my debrief and now leaving NHS! yay!",
    "they got me a box of chocolates and a gift card though!",
    "books there are kind of rubbish. maybe just magazines",
    "if it was Waterstones on the other hand...",
    "whsmith should survive an apocalypse like a cockroach",
    "thanks again jumblesale I best be off too. Bye!",
    "Haha that ring is menacing on its own.",
    "I like the one page manifesto. Joe does it well too",
    "a signal page feels like more if a found object",
    "Haha well you know I'm a big fan of yours",
    "cool I've just been adding functionality to mensch",
    "going to add regex to detect links etc",
    "its super easy to do with jumblesales new log",
    "i better go too later, catch you nossidge",
    "haha i assume you are talking abour r/itsaunixsystem?",
    "have you read ghost in the wire?",
    "ah thats exciting. how you managed that?",
    "ah right thats got to be a few months of tilde time",
    "you can name it after your city or town or something?",
    "ive got about four books half read",
    "just working on my mensch script",
    "its for parsing our stuff from the irc log jumblesale made",
    "I am having trouble saving files too cary",
    "something about a temp file being missing?",
    "or not enough space or something",
    "if i delete a file I can write the temp file",
    "df -h says /dev/xvdav1 is over 100% true",
    "haha 100% full! I am so tired I am almost drunk tonight",
    "if you delete something then you can quickly write a file",
    "its useful for keeping up with tilde happenings",
    "I have earned my position on chatty",
    "haha I knew I was bad but still",
    "nah, id never do that without you dan",
    "potasmic has come out of nowhere to get on the leaderboard",
    "alright man, best of luck with that",
    "yeah mensch -fp for the fridayphoto irc extract",
    "and then jumblesale has a python script that puts into html",
    "has a little readme at the top",
    "haha yeah go for it cary, what are you going to do with it?",
    "if its anything interesting id love to add it to mensch",
    "looking for ideas for things to add",
    "oh cary it does that already, just run mensch",
    "yeah just realised that, changing it now, thanksa!",
    "there we go, cheeky %s/karlen/user and job is done!",
    "up to anything interesting cary ?",
    "sounds like that would have been stressful",
    "surprises me how many big companies do that",
    "yeah, there is a reason the prebuilt seasons are popular.",
    "seasons? wow my typing is absolutely awful tonight",
    "if there is anyone in irc still could you say karlen",
    "oh no sorry, it only runs in the shel",
    "du -a | sort -n -r | head -n 20",
    "to see how much space you are using in general",
    "yeah i just chucked vim airline",
    "hey khoi, hows the bot working out for you?",
    "fair enough. what does the bot do?",
    "that's cool the regexp looks useful",
    "could you fetch the first paragraph from wiki for diverting",
    "could you fetch the first paragraph from wiki for example?",
    "well done. sorted the dependencies?",
    "oh right sounds like what i meant",
    "sudo is just like enabling admin rights",
    "how are you both this morning?",
    "khoi_: haha I was just testing my log parser",
    "thanks for fixing that at 4am!",
    "anyone here able to quickly run date +%z in the shell for me",
    "preferably not someone uk based",
    "thought that would be the output. shame. you alright?",
    "ah fair enough, thats not too bad",
    "yeah id probably forget to kill it haha",
    "i just have an rpi hosting my personal website, no stress",
    "when it was over, i cried tears in the rain",
    "then run ~karlen/bin/mensch -h 2 | ~karlen/bin/logtimeconv",
    "ok sweet, my local time log convertor works then",
    "haha sorry nossidge, to be fair yours is prettier",
    "but also mensch does time dependent mentions now",
    "the time dependent bit should make it easy for mr bot",
    "so how did you get the timezone autoadjusted nossidge ?",
    "haha i wouldnt abandon, prettiness is always good!",
    "nossidge: did you export TIMEDIFF first?",
    "ill fix that as a workaround anyway,",
    "nah its a good point, it needs fixing",
    "should work now without an exported variable",
    "kc how many of you are in? will it be limited to your HS?",
    "like id say maybe someone has to vouch for someone to join",
    "nossidge as always has a better solution",
    "cool! will add that to the script",
    "mensch -y for youtube is a thing now too",
    "just added the TZ stuff to the logtimeconv docs",
    "yeah I should do that actually shouldnt I",
    "was sort of worried about speed",
    "I keep thinking I am done for the day, then I carry on..",
    "just working on the getopts now",
    "coolm hopefully we will get a good number of posts on friday",
    "but parents are not always reasonable",
    "haha lets see if it works first, I am dubious",
    "haha hang on, it doesn't work on its own",
    "no worries jumblesale, in menopt its now -f I think",
    "sounds good on the protocol for fridaypostcard though",
    "will also write the docs up once I have recharged",
    "does the -z +0 flag work for ytou too",
    "yeah I really need to write those docs",
    "oh is that how mr bot works? ill add that back",
    "yeah that error makes sense, two mins",
    "nossidge, is /tmp/ shared on here?",
    "could save them to ~/.mensch-temp",
    "jumblesale did you supply a time diff?",
    "changed it all to ~/.mensch-temp",
    "woops tharts not good actually",
    "ok fixed, silly vim %s, I am too frazzled",
    "my R2 unit has taken some damage",
    "Stabilise your read deflectors, watch for enemy fighter",
    "Lock S foils in attack position!",
    "haha alt universe like star trek JJ abrams?",
    "haha nice one jumblesale! does it just return -h 24?",
    "also I added timeframes (-h) to chatty a while ago",
    "just wont have mobile internet.",
    "jumblesale: cool that makes sense",
    "oh actually that didnt work as expected",
    "mensch -s karlen -q mensch -z +0 -h 1",
    "hmm how did you run it? no arguments?",
    "so you can change it back to just mensch",
    "oh yeah, thats a good point. Should maintain standard",
    "sure, never done one before but can try!",
    "ok I got to walk into town and buy some funny foreign money",
    "got to leave town to go to town",
    "krowbar, no animals I am afraid. just men in hats and bears",
    "those are really cool, love the formatting",
    "really like the one on your page \"a stream of unconscious\"",
    "haha yeah! we need to talk in iambic pentameter",
    "could output a single user using mensch",
    "what are people up to this eve?",
    "what are you going to feed them marcus?",
    "plus have you had any luck on your project?",
    "imagine its going to be talk all day at work.",
    "yeah, hope its not too on the mark",
    "rain go for it! I don't use spotify though",
    "gah i should get back into spotify",
    "unless you can embed spotify into html",
    "both irc and .radio or both youtube and spotify nossidge ?",
    "irc probably would lead to more exposire",
    "thats weird, i was just looking at a walt whitman book",
    "whats the source for that one?",
    "did you put it there or was it there already?",
    "on the cluser at work it is all very individualistic",
    "haha yeah XXI is short and sweet",
    "there will be a massive one coming up soon",
    "so trying to get the pacing ok",
    "i gotta rock and roll. laters nossidge",
    "hey jumblesale, i am ok to switch -h to -t then ?",
    "haha that just fed me back the help file",
    "I copy it locally to my personal bin which is git'd",
    "yeah I can do if you think there'd be interested",
    "yeah thats a good point, better than going in cold",
    "just a shame bash is not a cool language haha",
    "yeah but its simple enough with some google fu",
    "cool, for adding stuff to the game?",
    "jumblesale: both of those things sound like good ideas!",
    "chatty is in ~karlen/bin/chatty",
    "get to use my batchgit script yay",
    "or ~karlen/bin/chatty -t 24 to just get the last 24 hours",
    "nah I use a shebang at the top so its all tidy",
    "tells the computer its a bash file automatically",
    "its nice, no messing about with bash * or *.sh",
    "khoi: its called !mentions here",
    "yright weird situation. my boss is asleep in my bed",
    "dan I don't know what my life is",
    "it was our research group Christmas do",
    "his wife sounded pissed (French)",
    "oh man. not sure what's going to happen in the morning Dan",
    "no docking Audy do you think I'm an animal",
    "it's not even that late that but been on it since one",
    "she's supposed to be my boss for fuck sake",
    "he's supposed to be my boss Haha",
    "did you say anything I need to reply to",
    "just hope his wife doesn't give him grief",
    "i am too worried about others to let them go",
    "would have been sensible but he lives far",
    "sorry I'm spamming you lovely people",
    "im a nut I'm a nut I'm crazy in the coconut",
    "what does that mean? the boy needs therapy",
    "sorry fearless bananas nice to meet you",
    "too caught up to say hello properly and for that I apologise",
    "going to get off tilde, being disgustingly self indulgent",
    "night all, thanks for making me feel better",
    "night mate, will try not to do this again",
    "motivation before christmas or something else?",
    "i have had a very strange morning.",
    "welcome to the 1K club dan and jumblesale",
    "aw im not in the code club. sad smiley",
    "to be fair the webring should be too",
    "i think i hate the idea of creating a random folder more",
    "surely bin is the unix standard for code?",
    "done, should be on there within an hour I guess then",
    "looks like it updates on the hour",
    "oh instead of the mud? looks neat",
    "jumblesale: we need to have a word about one of your tweets",
    "I have never heard that before",
    "its so ridiculous it must be true",
    "hmm just realised mensch is no good again for um",
    "ok fixed, just a -w flag needed for grep",
    "um vs jumblesale, the grep wars winter 2014",
    "Now I am become kill -9, destroyer of worlds",
    "oh wow three stars on github already. Rapid",
    "have a good day people, ill be around later probably",
    "i was checking out the leaves earlier nossidge, really cool",
    "is that the flags that decide that?",
    "anovak: now its time to fight crime",
    "too spooky, i blame tilde ghosts in the shell",
    "also I have recorded some NOWERTB in advance",
    "but I post pretty regularly every 48h",
    "i need to improve the docs though",
    "we'd need to run it as rss-roller --manual",
    "hmm audy's code searcher doesn't parse - in file namees",
    "id probably just do code=$(ls /home/*/Code/*)",
    "seems like an easier thing to do in bash! bash number one!",
    "ls /home/*/[cC]ode/ for case insensitivity",
    "oh, didnt realise krowbar got a second account",
    "god one of my fish is mugging me off. Can't catch him",
    "I saw an amazing koi tank in stockholm, ill find a pic",
    "haha thats awesome your goldfish just shrugged it off",
    "haha go to fj├ñrilshuset stockholm",
    "wow would love to see angkor wat",
    "well I only have two but they are fun little buddies",
    "ah awesome, I wish I had a dog. s/fish/dog/gc",
    "wouldn't get a very good dog for my fish though",
    "you see them rolling, you hating",
    "prefer big dogs but would love a shiba inu",
    "thats just what you want from a dog",
    "haha I was just about to post that!",
    "guess shiba inu are thick compared to pugs",
    "so same self same same self so",
    "gah so its hard to reproduce the errors?",
    "oh hopefully that wont be too bad then",
    "is reppard trying to beef us on audy's guestbook?",
    "oh doesnt run the ruby stuff I need anyways",
    "have you done a fridayphoto dan?",
    "mensch powers friday postcards",
    "so just ran it to check and it didnt work",
    "no idea, i suck at irc. Both technically and socially",
    "that was another drunk karlen story time",
    "\"I was a little disoriented in the morning\"",
    "i want to start using GPG to help protect people who need it",
    "oh ok cool, it will use the timestamp convertor too",
    "ok catchup exists and as is run as so",
    "ill fix it in the morning, just a quick one for now",
    "I just have screen full of 10?",
    "is it ctrl ] to quit nossidge ?",
    "thought so, telnet is not intuitive like that,",
    "hey jumblesale um and whoever else is at keyboard",
    "haha if lying in bed counts as up and about",
    "I'd be amazed if that's not one already",
    "I had to fix it last night night for https",
    "ok out of bed, ill give you a shout jumblesale when its safe",
    "wait did anyone actually post a fridaypostcard with JPG?",
    "i cant see a tagged JPG but there was joe's untagged JPG",
    "gah us UK people need a meetup in the new year",
    "luckily our country is far smaller",
    "thats a cool collection of locations",
    "worst thing to do when your hungover",
    "although maybe thats just tmux",
    "um it was lovely to see you on!",
    "as dan snuck two postcards in? the sauce of it",
    "too much emotion for a british petition",
    "thats a nice pair of words: british petition",
    "is mensch behaving for -f jumblesale ?",
    "um how was SF, was it the bee's knees?",
    "two quotes for the price of one",
    "like a shiba inu dang is charming",
    "what are you hoping to do with the bot um?",
    "dyu have much python experience",
    "im sure you will do a sterling job picking it up",
    "haha thats most of the way surely?",
    "i guess I will have to learn functional programming!",
    "haha we'd hate to lose you for sure",
    "oh cool, any podcast recomendations?",
    "no dont think i have heard of that one, will check it out",
    "but I know tilde.town is an accepting environment",
    "nooo I knew this day would come!!",
    "just subscribed to 99% invisible and radiotopia um",
    "BBC world service documentaries is always excellent",
    "BBC Radio 4 comedy of the week too",
    "BBC radio 4 from our own correspondant = is always excellent",
    "BBC friday night comedy > bbc comedy of the week",
    "that was a nightmare for old mensch",
    "I haven't heard that, is it a podcast?",
    "thats awesome, is she from zanzibar?",
    "haha a far way, my ex was/is from kenya but never went",
    "would like to be more well travelled",
    "haha im probably too poor to go anywhere now till 2016",
    "hey khoi, on your computer? vm or dual boot?",
    "too culturally alike jumblesale",
    "haha thats fine, you dont have to fully ascend just yet",
    "yay apparently suitcase is 21kg / limit is 23kg",
    "if bathroom scales can be trusted",
    "khoi have you done a post card?",
    "jumblesale: when does the script start running?",
    "haha i just did a silly one of book case khoi",
    "yeah fp sorry jumblesale, today is GMT 0000?",
    "thats a cool photo khoi, i love industrial stuff like that",
    "UTC is the centre of time and is interchangeable with GMT",
    "haha yes fish, my sister is going to feed them in my absence",
    "i like jumblesale you took a moment to consult the oracle",
    "maybe have it dish out a random quote when you log in?",
    "thats clever reppard! why do call it a radiator though?",
    "dan, will you give it the new gif? love that gif",
    "its freezing here and the work radiator stuck out!",
    "yeah was thinking that, its 1159 here",
    "I am here till about the 11/01/15",
    "haha true. Spending the holidays with my girlfriend so work",
    "glad to hear it mate! that sounds like a pain in the arse",
    "hey kc, im good thanks. How are you?",
    "haha I love DIY, but I am not necessarily good at it",
    "yeah I think so, describes the quaternery sector of work",
    "what do the different lines represent?",
    "and maybe a more distinct colour range",
    "blue is newest to green oldest now?",
    "is there normally an X axis for time?",
    "cheers mate! hope you are having a nice time!",
    "gah sucks, hopefully won't keep you there much longer",
    "same, im only here as girlfriend is at work",
    "hope you have a real nice time dan",
    "merry christmas eve eve xmc, hope seattle is merry",
    "yes happy holidays whatever way you spend them.",
    "Timezone agro from portland to nyc vilmibm ?",
    "really liked it, it was what I mean ahah",
    "like how it turns in the final stanza",
    "nossidge, obviously can't run your file but sounds awesome!",
    "dan, I can't reply to your email but will do when I can",
    "hope everyone is having a nice new years",
    "haha when I get the chance I will definitely give it a play",
    "haha I am glad I have finally been toppled",
    "yeah, i noticed, couldn't even ssh/mosh in for a while"
  ],
  "kc": [
    "do you want to build a stapleman?",
    "~kc/active.html is slowly getting out of hand",
    "and the rest aren't worth memorizing anyway",
    "my short answer to your question is: no.",
    "yeah, sure, it definitely corresponds to that",
    "Exactly! I saw that too, and I thought that was great.",
    "GeoQuest: Can you save Mr. A. Square before it's too late?",
    "is this some sort of Markov generator?",
    "um, you're a terrible personddi love you um",
    "i should probably close the activity logger",
    "it's generated a 15k file in 2 days",
    "tell that to poor chart.js, it's suffocating",
    "but there's a clear pattern emerging",
    "i mean, i could just collect data less frequently",
    "but the #points still increases every day",
    "gosh, i'm really lovin' Google Keep",
    "that is... deep and mildly disturbing",
    "nossidge: do you type LSD a lot? :P",
    "is there a Bash way to prepend to a file?",
    "^^ I'm going to send that to my CS teacher",
    "you need @-webkit-keyframes too",
    "it still doesn't work on my Safari",
    "now we can talk about how you used `error` as a verb :D",
    "magical: there are other ways to center a single character",
    "chart.js is dying a painful, gruesome death",
    "i may need to switch to a better charting library",
    "yeah, i'd absolute-position to left:50% top:50%",
    "i just really dislike using tables for not tabulating",
    "i mean, C'MON NATURE I STILL HAVE INTERNET",
    "schools closed and all (not mine, ofc)",
    "eh, we have finals next week so it's probably a good thing",
    "the storm continues to disappoint",
    "but i'm editing the code right now",
    "karlen: warnings shouldn't be graceful",
    "now it has different graphs for each day",
    "superimposed on each other for a comparison",
    "i want to just remove the axis labels altogether",
    "nossidge: have you heard of Ian Stewart's tautologies?",
    "\"Too many cooks cook too much\"",
    "how do you add a quote to quotebot?",
    "btw my teacher shot down my proposal",
    "um: ~kc/public_html/proposal.txt",
    "we calculate $10/month as a minimum",
    "so the quote adder got mad at me",
    "\"NameError: name 'tweet' is not defined\"",
    "Brazilian music is soooo much fun",
    "i've been playing Chega de Saudade",
    "(like writing Factorial with IF and two return statements",
    "robbymeals: i'm a high school student",
    "robbymeals: yeah, CN's my blog-in-progress",
    "mmm i had mac n cheese earlier this evening",
    "As in, with actual Kangaroo meat?",
    "as a quotes-database sort of thing",
    "karlen's maintaining a log, right?",
    "oh, wait, does the logger go to sleep when karlen does?",
    "oh, I just tree'd her directory and hoped it would show up.",
    "whoops, yeah. fingers on autopilot today",
    "apparently I'm a very negative person",
    "My text is 58% negative, 41% positive, 16% neutral.",
    "aww, crud, messages to me apparently generally negative",
    "i generally just do `python file.py`",
    "dan: pipe English to python ~kc/sentiment.py",
    "Positive -> probability that the statement is positive",
    "Negative -> probability that the statement is negative",
    "Idk why they don't add up to 100%",
    "also there's a daily request limit",
    "we should start deleting stuff",
    "how do you find out how much is in your ~?",
    "anyway, should i do it in Python or JS?",
    "if I do it in Python, I'll probably learn stuff",
    "I'm sure there's something to be said about that.",
    "Yes, actually, it's part of a much bigger issue.",
    "Which is that the root directory is full.",
    "eventually vilmibm 's gonna come one and fix everything",
    "it sort of makes me continuously cringe",
    "i dunno. we aren't allowed to have it school-affiliated",
    "a lot of good domains are taken already",
    "ooh, that book looks great. didn't know kevin mitnick wrote.",
    "my favorite hacker novel is Cryptonomicon",
    "gosh i haven't actually read a book in months :(",
    "hmmm have we cleaned up the server yet?",
    "Oh. I wall'd a couple times hoping his terminal would bell.",
    "finger: /dev//pts/105: No such file or directory",
    "\u0001ACTION decides he doesn't *really* need vim-fugitive\u0001",
    "my biggest file is now .tin at 92 bytes",
    "you aren't, by any chance, an admin?",
    "just watched \"You've Got Mail\"",
    "is this a node module or a handwritten bot?",
    "so that instead of crashing, it tries to survive",
    "a freenode netsplit killed irssi",
    "Did you make sure to nick/user?",
    "NICK bob\\r\\nUSER bob * * :Robert Barone\\r\\n",
    "i need to choose between Python and JS for a project",
    "So we're making backtick.town the ~ for highschoolers.",
    "dan: karlen: server's up, now we need to configure it",
    "i just did crontab -l > temp.cron",
    "grr, studying for finals. i should have started earlier.",
    "shanx_: I'm good, how are you?",
    "krowbar: well, no, but i think that's beside the point",
    "I'm fine. Finals week and all.",
    "I should be learning French right now.",
    "except when you mention me, then you're yellow",
    "nossidge: you can do user-installs with gems",
    "i feel that should be spelled phridayfoto",
    "karlen: you out-social me here",
    "\u0001ACTION realizes he needs to speak up more\u0001",
    "there's also darkmail and company",
    "yaaaaay my grade-email-alert thing worked",
    "on another irc channel, we have a bot that lets you say",
    "and then when karlen comes back, it'll pm him the text",
    "what's [Errno 32] Broken pipe?",
    "that was surprisingly convenient",
    "i was testing a bot i wrote as a demo for a blog post",
    "someone remind vilmibm to update git asap",
    "selfsame: you just discovered Harvey's Law of Web Design!",
    "day didn't change here in california, afaik",
    "i've only contributed to one serious project",
    "because it's not really worth it",
    "400+ commits, 60+ contributers",
    "wow, i'm almost at 25,000 words for my blog.",
    "It that was computer-generated, I will be very sad.",
    "nossidge: I got some procedural music generation working.",
    "give me a moment to record a decently-sized learning set",
    "um: yeah. I just feed it to GarageBand",
    "i now face two weeks of boredom. :P",
    "Mercury is like Prolog, right?",
    "...trying to homebrew haskell. Do I want cabal?",
    "yeah, but I like using homebrew for everything",
    "Cool. I'll be back in a bit (buying drano).",
    "Haha, yes. Cronjobs are messy to test. :/",
    "i'm fine. we've been building IKEA furniture.",
    "\"if I ever see another hammer, I'll puke\"",
    "the yellower it is, the more recent.",
    "lemme see if chartjs lets you do that",
    "but I forgot which end of the spectrum H=0 is.",
    "um: remember how I was buying drano?",
    "um: yeah, i'm a high schooler, remember?",
    "Yeah, we thought about a lot of names.",
    "you mean accidentally rm -rf'ing my Desktop?",
    "I've been meaning to write a decent IF for ages.",
    "well, depending on your setup, it can auto-reconnect",
    "i just leave everything in a tmux and detach when i'm away",
    "oh, right. i've made peace with irssi :D",
    "there, hopefully shanx gets that",
    "\u0001ACTION is still chugging along on irssi :(\u0001",
    "um: lambda.land is an awesome name",
    "audy: tilde.town/~kc/active.html?",
    "the source js is chmodded g+w so feel free to hack on it",
    "*unclear what the arguments actually mean",
    "btw 15 users on backtick.town now",
    "i just did -xf and hoped it wouldn't eat my laundry",
    "*sigh* The internet's so quiet on Christmas Eve.",
    "I've got a lot of canvas experience.",
    "Making <canvas> work is all about aggressive abstraction.",
    "You can remake the whole thing in canvas :)",
    "(Then exporting an image is trivial.)",
    "Lemme dig up some useful docs for you...",
    "it's one of these online learning things",
    "they have an HTML5 game dev class",
    "i'd recommend doing the class *after* writing a simple game",
    "because honestly, learning to code from a video is a pain",
    "it's only useful for the occasional industry protip",
    "(such as \"use spritesheets if you care about latency\")",
    "bye coaxial, happy holidays :)",
    "aww vilmibm you're an awesome sysadmin :)",
    "i've been writing stuff in haskell",
    "fearlessbananas: Learn You a Haskell (For Great Good)",
    "my handwriting looks so weird after a week of not writing",
    "also, that's a really cool skull",
    "and then, of course, there's 2048 :)",
    "at some point in my life, i used to pwn at mtrek",
    "there aren't any copies around these days",
    "I have alias mtrek=\"telnet mtrek.com 1701\" in my .profile",
    "but..that jesus-cross lightsaber...",
    "hmm, how terrible is it to nest ssh sessions?",
    "which should be called sesshions :)",
    "yeah, i should watch out for that",
    "but that's slightly inefficient",
    "if you find breadcrumbs, you know you're going in circles",
    "at least it'll be in a house of candy",
    "does `tree` have an option to show modification time?",
    "gotta go interface with the real world",
    "yeah, doesn't even try to hide itself",
    "you were right, it's a dangerous world out there",
    "yay 3 yrs of french paid off right there",
    "our teacher plays a music video every friday",
    "i'm thinking of ways to promote backtick",
    "(and partly because money is expensive)",
    "anovak: nothing. users need to be smart.",
    "what currently stops me from owning go0gle.com?",
    "reppard: awesome! did you make anything?",
    "reppard: nice, have fun with that",
    "morphic.js implements all that in a single <canvas> element",
    "anovak: no, you can't write code through the GUI.",
    "A lot of people (like me) just create a LICENCE.txt file",
    "`top` still claims i'm using 30% of the CPU",
    "(it just waits for the server to accept me)",
    ">>> while True:\\ time.sleep(1)\\ ...",
    "why doesn't topicbot edit the topic?",
    "have we looking into setting up a BBS?",
    "they want a phone number to join",
    "i might code some bbs software",
    "and daemons automatically sync with other known servers",
    "But I want to write it in C to be old-fashioned.",
    "i'm always wearing the same jeans and jacket",
    "i did some haskell a couple days ago",
    "um: i learned that i like haskell and i also hate haskell",
    "Static typing seems to be more of a restraint than a tool.",
    "THey use smalltalk-ey syntax for message calls.",
    "[object doMethodWithArgument: 12 andAlso: 13];",
    "Scratch was what taught me to love programming.",
    "the smiley looks rather sinister with the big black \"X\"",
    "alistair: chilly, but nice and sunny.",
    "alistair: finally a break from all that rain",
    "I want more Piaget experiments to do on her.",
    "...and she escaped to go watch TV.",
    "ugh i need something to write. english or code or something.",
    "No, because the old ones are written in HTML.",
    "I want an HTML to Markdown retroconverter. :P",
    "soooo mannnyyyy deepppeeendenncccieeeessss",
    "why the heck does it want \"cipher-aes\"?"
  ],
  "khoi": [
    "yeah, doesn't work with colons.",
    "I don't know python, but using regex is more flexible",
    "are you listening to all channels?",
    "Maybe you should choose the [2] instead of [-1]",
    ":username@something PRIVMSG #something: message",
    "Push to GitHub, pull from GitHub back to Tilde..",
    "Something like: screen -S \"nodejs test.js\" -d -m /script",
    "Hmm.... -m... I need to look that up",
    "convenient when killing screens hehe",
    "Or I'll just execute in other languages..",
    "assuming 140 is the average line length",
    "quote_bot should let us add quotes",
    "Thanks guys @ dan & karlen_work",
    "I hope my friend knows more about programming and systems",
    "Yay! it works! (and it spams, too X( Sorry)",
    "This is good. I know that my bot will work. Rewrite time :D",
    "karlen: www? you make me think you're an anime person hehe",
    "I don't know how to use vim lol",
    "That's why I avoid commiting messages in Git through vim.",
    "jumblesale: Have a good day at work!",
    "jumblesale: Go away to where? :o",
    "jumblesale: Ah, have fun! I'll search up where that is!",
    "I just can't boot into it anymore, so ...meh",
    "Hope I could sum up Potasmic and khoi",
    "jumblesale: I don't understand by \"do a year\"?",
    "^that: what do you mean by \"do a year\"?",
    "got my public key transferred \\o/",
    "where can I access the chatty command?",
    "karlen: I tried cd chatty but it doesnt owry",
    "I thought I needed to do bash or omething like that",
    "guhh.. my s key is so unresponsive",
    "i need coffee whenever i sleep in class",
    "Need to fix my bot but lazy :P",
    "I'm planning to install openSUSE",
    "karlen: I'm still gonna use 2 OSes though hehe",
    "karlen: I haven't seen any nice scene to take lately.",
    "I'm just gonna kill my bot in case anybody hacks it",
    "Nah, you didn't break my bot, I broke it days ago :P",
    "um: Nah it's cool. What language are you building thi in?",
    "Earth is a sphere, GMT can't surely be the center.",
    "so my friday postcaed will ve queued for next week?"
  ],
  "klangspiel": [
    "I'll be sure to document everything once I get coding :)",
    "I just fixed the dumbest thing",
    "my performance would suddenly linearly drop from 120fps to 0",
    "anyway, now that this is done player movement will be next"
  ],
  "krowbar": [
    "yay! python! i think that was the second language i learned.",
    "kinda something fun and random",
    "oh, oops. /~Krowbar/mission.html",
    "but the js is visible easy enough",
    "it's made to be a silly one-off",
    "but maybe that's also part of the tilde feel",
    "@karlen: i suppose, but i'm connecting from a win pc",
    "and i still don't know all the hidden features yet",
    "well, it sounds like you english well enough",
    "anyway, i've got to go home now.",
    "the humble bundle games really make headway there, also",
    "have you listened to the df podcast?",
    "and they only release episodes like ever 3 - 12 months",
    "there are a few other amazing ones",
    "nobles were always the most annoying in df. >_<",
    "jumblesale: it's usually a season",
    "there are several good shortcut tables in the book",
    "i typically just grab the lazy newb pack and call it a day",
    "that was an isometric one, right?",
    "oooh, that looks like a cool script",
    "ah, sure. i guess that's a derivative of pine?",
    "i like that quote. Bjarne has said some good things before.",
    "\"This is gold leader: standing by\"",
    "speaking of which, did you see the new starwars trailer?",
    "write phasors at full capacity",
    "i believe it was all blessed by lucas arts",
    "or lucas file or lucas something",
    "karlen: what's happening friday?",
    "i think your script could use a -h or --help",
    "man, write a man. i want to play with this, too",
    "sounds fun. get a money with an animal on it",
    "and, bam! it's clobbering time",
    "it was all of several dozen lines of html anyway",
    "and the js i wrote is still fine",
    "marcus: no kill like overkill, huh?",
    "rain: that sounds like the best time to not shave",
    "depending on whose english you speak",
    "karlen: did i show you the silly javascript toy i wrote?",
    "oh, right. i did. well, i added a few more items",
    "anyway, time for me to call it a day as well",
    "jumblesale: i'll send you an email with my personal email",
    "oh dear. visual studio 2012 just crashed",
    "jumblesale: i'll post something if i think about it",
    "marcus: have you worked with lodash or underscorejs ?",
    "jumblesale: what is twine and what do you want to colab on?",
    "i'd like to do something like that.",
    "it was, and it started my love of computer programming",
    "\"Questions & Answer Book About Computers\"",
    "and i'm sure whoever that was then went on into marketing...",
    "dude! i just found a qbasic emulator in js",
    "it seems to use the CANVAS tag",
    "i created an instance of twine2 at /~Krowbar/twine2",
    "since their archive sets are just single html files",
    "no, the whole thing boils down to a single html file",
    "i got an instance of twine2 running",
    "nossidge suggested using a repo, which could work.",
    "normal users don't get access to cron, though, do they?",
    "things are good. thanks for approving me. :)",
    "serious question: how hard would it be to de-uppercase me?",
    "apparently someone had issues sending mail to me",
    "and i didn't read it carefully enough",
    "vilmibm will i need a new ssh key?",
    "nick: this experience has been incredibly fun",
    "anyway, i'm off to give blood at work. be back in a few",
    "and if i don't see you, goodnight",
    "jumblesale: i've been de-capital-ated",
    "now i am like one of the rest of the plebians",
    "jumblesale did you end up making a repo?",
    "anyway, i got to get going. good evening and goodbye.",
    "jumblesale|work hey, it works!",
    "yesterday i gave blood and felt pretty tired in the evening",
    "i think the quote list isn't large enough",
    "audy \"if you don't know math then you can't server justice\"",
    "i think i probably got reset when i de-capitalized",
    "we'll see if i can make the top 10 twice",
    "my favorite irony is that htop is usually at the top of htop",
    "nice. the file seems a bit dense but still readable",
    "so it's not a just a linear story progression",
    "or \"you see a note that says 'jumblesale wuz here'\"",
    "it could be like myst with little story islands",
    "dude, this has me a little hyped",
    "jumblesale i really like that idea",
    "but who say that your story can't have a portal in the cave?",
    "this way we can keep everything on the town as well",
    "you really found a great solution!",
    "hrm, honestly i'm not too keen on the character \"class\" idea",
    "it seems to add unnecessary complexity",
    "a more generic framework would probably work better",
    "nossidge Hrm... i guess that's what we'll be learning.",
    "jumblesale yeah, that sounds fine",
    "jumblesale should these stories be losable?",
    "i don't really like the \"you die\" stories, either",
    "especially if we're doing a group thing",
    "jumblesale or at least the base.twee",
    "i'm working on a guildeline doc",
    "jumblesale i'm still working on soemthing",
    "i can't find any docs about hashes",
    "le'sigh... i'll move it out of my ttitt dir then",
    "you can see my problem at ~krowbar/twine/twineTest.html",
    "and overriting them when entering the passage. >_<",
    "nossidge er, \"<<display >>\" no \"<<show>>\"",
    "nossidge ah, yeah, you're right.",
    "ok, i got something i'm happy with",
    "check ~krowbar/twine/twineTest.html",
    "and we'll put that inventory object in the global scope",
    "i'm working on a global inventory system",
    "i keep breaking and fixing and improving it",
    "yes. there's a postrender object we could modify",
    "let me see if i can goof with that",
    "jumblesale: i'm having some trouble with newlines though",
    "karlen: for yourself or for some cats?",
    "oh, food for fish. not from fish",
    "to initialize the global objects",
    "hrm, maybe i'll try that instead, then",
    "jumblesale oh wait, i think it's because i'm dumb",
    "i actually need to turn the script into a script",
    "jumblesale: that resolved the duplicate users",
    "nossidge: i added a macros.twee in my ttitt dir",
    "wait, macros don't need to get folded into the ::Start",
    "jumblesale: the global definitions",
    "i moved it to ~krowbar/ttitt/globals.twef",
    "yes. or else the other stuff yells \"can't read that\"",
    "wait, maybe if we just have rules for passage names",
    "i think that's the most elegant solution",
    "and probably a <<nobr>> around that",
    "aww, and i had something to show jumblesale",
    "uh, i think that broke something",
    "which is why i need jumblesale to add the <<Init>>",
    "no, since it would overwrite everything",
    "but you can add [inv] [stats] [skills] tags to pages",
    "and add things to $items['NAME'] = VALUE",
    "maybe i should put that in the macro file too",
    "where are you getting these texts?",
    "hehe, grab one for chrono trigger ?",
    "jumblesale did you do any more twine work over the weekend?",
    "yeah, i know how the \"work\" from home often goes...",
    "it seems a bit more like \"on call\" from home",
    "marcus: ah, a 3ds game. i only have a ds",
    "and i can't seem to stop calling them \"gameboys\"",
    "i think i can now start to sympathize with my mother",
    "are they backwards compatible?",
    "my old roommate's cat ate through my ds power cable",
    "and i never picked up a replacement charger. :/",
    "i was only playing pokemon heart gold on it, anyway",
    "i feel more drawn to building tools and toys",
    "and framework and support stuff",
    "that seems really neat but really intense",
    "i read the breakdown the one guy poste on HN. that was cool",
    "if they're not in the rap, they're not really pokemon",
    "i think that's the curse of a living card game",
    "it's pretty neat how organic it's been",
    "but i can't tell you the rest if you're not initiated",
    "although a mistaken 'rm -rf / dir' would count in a pinch",
    "marcus: i've done that as well.",
    "maybe you could consult @gameideamachine",
    "it goes alright. i'm working on some javascript stuff",
    "are you hype for christmas or whatever you celebrate?",
    "have a nice holiday, nossidge?",
    "anything in there i specifically needed to know?",
    "i like how the user names have consistent coloring",
    "did you key the color on a name hash of some sorts?",
    "so i have a game that i like playing with spam emails",
    "the parts that probably got ripped from wikipedia",
    "well, i read those as the synopsis of a TV soap opera",
    "and it often sounds quite compelling",
    "call it \"Wikipedia: The Best Parts\"",
    "or \"Geology, Small Town Council Minutes, and Love\"",
    "grrrr... company technical bureaucracy is really annoying",
    "can i change my timezone in irc?",
    "/script exec $ENV{'TZ'}='<YOUR TIMEZONE>'",
    "that makes my timestamps actually mean something to me now",
    "vilmibm is this a good or sad thing?",
    "kc i don't know but i think not",
    "ah, yes. there appears to be one",
    "\"you know what I mean\" can only be stretched so far",
    "i've enjoyed using linux mint a lot more",
    "\"today in tilde-world problems...\"",
    "anovak but it's easier to put it at the top than the bottom",
    "just think about all the old style diff programs",
    "thank goodness for well designed source control",
    "you need to put ascii art around the boiler plat, too",
    "kc: is that your super power? \"Berkeley Snap!\"",
    "so, what's today's conversation?",
    "it was probably more someone made him do it in 3",
    "three points of sale = more monies",
    "two films for the hobbit would have worked well",
    "so, have y'all got any new year's party plans?",
    "papa: when you say \"best whiskey\", whose standard is that?",
    "ah, well if Bill Murray approves, it must be good",
    "(that's what happens with gifted games)",
    "i think i once played a full 7 player game",
    "papa: yep, we all signed up with the \"no drama\" clause",
    "papa: i think you want a * after your []",
    "papa: why would you apologize about learning something?",
    "huzzah! break open the fattened regex!",
    "so topicbot will hold onto the topic, who set it, and when",
    "the regex has a hard coded channel name. bad bad bad",
    "lately i've preferred ruby for scripting",
    "i'm doing a little more work on topicbot so he's going down",
    "um: i changed teh version in my Code/irc dir",
    "that's in my ~krowbar/Code/irc/topicscores.txt",
    "kc: i think i'll incorporate that...",
    "kc: ok, now it will count when you use /topic as well",
    "having random interesting topics would be funny, though",
    "ok, so random topics available",
    "i couple lists of \"interesting questions\" i found",
    "we could always use \"sonic wisdom\" though",
    "you could be a scooby doo character",
    "it will give up to the last 10 topics",
    "there we go. an unclosed file handle",
    "sigh. ok. i think it's good this time",
    "have fun not crashing it. i need to get going"
  ],
  "longshanx": [
    "i will probably pass out soon because i am old and crotchety",
    "well that deescalated quickly :)",
    ":) crush those finals! and sleep well!",
    "criminy what time is it over there um?",
    "hehehe that turned around on time, huh?",
    "now i get it when people say I'm patient with computers",
    "yay for writing down all the things!",
    "whats the thing you wrote about?",
    "the fist town thing? gotta link?",
    "oooh, i like the format you used!",
    "esp the link to the \"final answer\"",
    "excellent job on the cron+cURL doc!",
    "and then use those to plug into their documentation",
    "with this folding capability i imagine",
    "holy poop thats like 2 weeks from now",
    "how the hell did this year close so soon?",
    "and each year is subjectively shorter?",
    "burritos are outside the realm of par",
    "all burritos are the same score",
    "that skirt is breaking my brain",
    "is it a coat hanger? are those actually pockets?",
    "do you not count your last tweet as poetry?",
    "or did you write that >2 wks ago?",
    "\u0001ACTION thinks tilde.town is a bit poetic \u0001",
    "my usual methods are useless here",
    "a poster about dancing the tango",
    "much like robyn, i prefer dancing on my own",
    "well, i guess she doesn't prefer it",
    "i am; he's working on something completely differnt",
    "right now, that involves hella data cleaning",
    "then update/delete in target system",
    "OMG THEY ARE THE PONIES OF AUSTRALIA!!!",
    "THEY ARE THE WOMBATS OF THE SOUTH AMERICAS!!!",
    "if ron perlman was a pony, he would be a capybara",
    "good guy greg of the rodent family?",
    "these puppies are killing me dan!",
    "i have an rss full of LOL-aggregators",
    "i have used these to perfect the nag email",
    "why don't you just turn that off?",
    "did i get to use my paracord & matches?",
    "that sounds much better than a survivalist excursion",
    "abandoned canadian mansion sounds like fun",
    "this is sounding like an awesome movie now",
    "did we learn a valuable life lesson by the end of our trip?",
    "\u0001ACTION jealous of vilmibm s awesome sounding dreams\u0001",
    "have you shared this with kara?",
    "she likes lovecraft and good stories",
    "i think she would get a kick out of this",
    "regarding cleaning or working?",
    "and breakfasts of goldfish & coffee",
    "i speak of breakfast primarily hypothetically",
    "i normally only have coffee until noon",
    "ah. well thats a horse of a different color",
    "its a legit gripe; just not one i can really comment on",
    "in order to not fall asleep on the couch, i am bidding adieu",
    "have an excellent night, y'all"
  ],
  "magical": [
    "mayhaps i need more vendor prefixes",
    "yeah, looks like webkit still needs prefixes",
    "uh-oh i hope webkit supports unprefixed flexbox",
    "are there any helpful error messages in the console?",
    "well that definitely didn't work"
  ],
  "maja": [
    "brooklyn, hm. must be an exciting place",
    "um: yep, i live in Berlin for 3y now",
    "it's nice but i get really annoyed by it from time to time",
    "oh, your german must be better than mine"
  ],
  "marcus": [
    "oh, hey, I bet I have to say marcus first",
    "Or Alt+Left to cycle through all your windows.",
    "I think your split on : is what is missing the mention",
    "This is end user testing at its finest! :)",
    "Nope, looks like you want to filter on \"PRIVMSG #.* :\"",
    "if you can figure out how to do that regex style",
    "nohup means that the process will ignore HUP signal (hangup)",
    "Not sure, khoi. I'm somewhat limited in my knowledge. :D",
    "(Can you tell I've worked support for too long? :P )",
    "I feel like I'm back on a BBS here. :)",
    "Morning! Yes, it seems this is a rather active community.",
    "I kid of like townies, but both seem appropriate.",
    "My 'n' key sometimes doesn't register, it seems.",
    "Cool, jumblesale, I'll take a look at that.",
    "I just got my mentions from it.",
    "you type \"/msg quote_bot !quote\"",
    "nossridge requested that quote",
    "The funny thing is the IRC log doesn't log the quote. :D",
    "Heh, I was wondering about the \"yourname\" thing. :P",
    "I prefer less symmetry, personally.",
    "I still kinda prefer the asphasurvey link",
    "hi jumblesale, how goes your projects?",
    "You folks make me feel rather uaccomplished, sometimes. ;)",
    "marcus123235346423536252 testing something",
    "ah, good. Was stress-testing your mentions function. :D",
    "(Pickup game ... we don't keep track ... lots of goals)",
    "Have you automated the process yet?",
    "oh, heh, the one they link to has had the account suspended.",
    "I have all the material, and it's fairly iformal.",
    "You can set your nick to whatever",
    "I'm currently downloading the MP3's from your ~ page, karlen",
    "hmm ... beards ... I really need to shave.",
    "morning, dhgwilliam (afternoon here, though)",
    "After, I finish up work here, and feed the family, etc.",
    "What's new and exciting today?",
    "It's been a while sice I did any PERSONAL projects in C++",
    "Checking my PDF collection to see if I have that one. :D",
    "Nope, that's one I have not come across.",
    "The 80s were filled with those books.",
    "exploding bananas = GORILLAS.BAS",
    "I'm sure that's in my bookmarks somewhere. :D",
    "We're probably looking at the same version",
    "So, the twine is definitely gettig started? :D",
    "Timestaps on the mentions! That's useful.",
    "hi krowbar, jumblesale, nossidge",
    "so, to make rooms we need to follow what steps?",
    "Nice. I'll have to take a look.",
    "All these awesome projects on here. :D",
    "You can probably use a sticky bit",
    "Can you make your script check for \"Start\"?",
    "And deny changes with that keyword?",
    "hmmm ... let me take a look at your directory ...",
    "will have to test in my own dir",
    "Morning, reppard! Seems awfully quiet here today.",
    "oh, we have a second bot in the chat.",
    "Which can play the old GBA games.",
    "Might have me mixed up with another.",
    "Whitespace is important to be aware of.",
    "Heh, I'm chugging away on Putty on my Windows box. :P",
    "Time to go. Good day to you all!",
    "Good advice. I shal endeavor to follow it.",
    "What's with the \"test ...\" line?",
    "Oh, nice ... congrats on getting married this year!",
    "My wife is insanely jealous of my reading speed.",
    "*my buddy and I, that should be",
    "ah, strategy board game ... interesting",
    "I ejoy Puerto Rico and 7 Wonders as well.",
    "Words to live by from a very intelligent man.",
    "Rejected: Unable to reproduce. ;)",
    "s/self-challenge/self-challenge/",
    "So ... I don't know how to answer your question yet. :P",
    "Also, I'm going to try and blog as I go on my main blog.",
    "The \"successful\" games were sold to friends in High School.",
    "I wasn't coding that one, just working sound and music.",
    "I'm not even going to try and fix my typos.",
    "Anyways, I gotta jet. Take care, all!"
  ],
  "nick": [
    "is there an issue with usenet?",
    "jumblesale: amazing, thatÔÇÖs not a lot of code",
    "it looks through everyoneÔÇÖs index.html page",
    "hmmm looks like the disk is full again"
  ],
  "nossidge": [
    "Hooray! Sorry for the newbishness.",
    "~nossidge/randomgen/gothy_band.bsh 20",
    "Yeah, pretty much. Although it's redundant I know.",
    "For my work job, I need to use Korn, so I guess that's why.",
    "Did someone privately !quote to it?",
    "So when you private quote, it quotes out in the open.",
    "Never used it before until yesterday!",
    "You don't need Facebook. You can trust me on that.",
    "Here's a question. Is this interesting?",
    "I feel it needs some rhyming / scanning with the output.",
    "To make valid verses or rhyme schemes.",
    "Although, could someone do me a quick favour?",
    "Run this and see if it fails on you.",
    "~nossidge/snowball/snowball_irc.bsh",
    "Cool, thanks. Need -f I guess.",
    "I'm not sure about where to create temporary files.",
    "Yeah. Just some input for my Snowball generator.",
    "Although for your name it might be quite, um, noisy.",
    "I second tilde.town/~karlen - It's brilliant.",
    "It adds it to quotes.txt in your working directory!",
    "If I knew how to send mail, I'd tell frs.",
    "Oh god, alpine broke my display.",
    "I'm using Git Bash on Windows.",
    "Phew, I'm out. I'll stick with mailx in future.",
    "Right. Got some stuff to do. I'll be back in an hour or so.",
    "Okay, I updated the wikiquoter.",
    "~nossidge/quotes/wikiquote -n5",
    "~nossidge/quotes/wikiquote --type knock",
    "Next step is to get a quote from a specific person.",
    "I'm afraid so. I can only apologise.",
    "Pretty good. I got this working:",
    "~nossidge/quotes/wikiquote --person 'Winston Churchill'",
    "~nossidge/quotes/wikiquote -n5 -p'Winston Churchill'",
    "~nossidge/quotes/wikiquote --type knock",
    "Yeah, it's buggy at the moment.",
    "It's my favourite joke snowclone.",
    "Couldn't you just send the output to \\dev\\null?",
    "Or does that give you some weird stuff too?",
    "Ah, it's the number of lines I've spoken in chat!",
    "Is it based off ~jumblesale/irc/log",
    "Is that a log of forever? Or just 24 hours?",
    "Then I can swap my mentions() function",
    "mentions() { grep $USER ~jumblesale/irc/log ; }",
    "dan: And this removes the join/quit messages too:",
    "Not sure what I mean by that. I'm... a mutant...?",
    "\"i am she that would awaken strange emotions\"",
    "The results were too kinky for my poor innocent Twitterbot.",
    "It is a lot of fun. Chatbots always are.",
    "Can you think of anything you would add to this:",
    "Thank god. 'Cause that was just stupid.",
    "I use all of lsf lsd lsa all the time",
    "(I like that the letters are close, I mean)",
    "Sounds great! I'll pay for your first month!",
    "Also Chrome on Windows. Version 39.0.2171.71 m",
    "Tilde not spinning, background remains Rebecca.",
    "Just updated to Chrome Version 39.0.2171.95 m",
    "It's mostly silly stuff from abandoned text cutups/mashups.",
    "I felt I needed something to fill the space.",
    "Has anyone worked out my riddle yet?",
    "Need to get !wikiquote working.",
    "shuf -n1 ~nossidge/quotes/liff.txt",
    "Also to turn the timestamp into human readable?",
    "How long can irc nick names be?",
    "Seems like 20 hcars is the max",
    "Okay. I figured out why my tilde ring javascript was broken.",
    "It was because of the javascript sketches on there.",
    "Javascript doesn't play nicely with other javascript.",
    "So I stuck them in iframes and it's all working.",
    "Too many on one page might break for some people.",
    "Your project is the best thing on this site.",
    "I was going to make one of those...",
    "Ahah! His version is static. I could still do a JS one.",
    "Ooh, a wedding! Was there a drunken uncle?",
    "7 hours and 13 minutes till sunday!",
    "I think we only get about 20 megs max.",
    "Or set up a test Twitter account.",
    "ps lists all processes that wre being run by you.",
    "ps -e lists all process by Everyone",
    "And ps -f lists the Full informatino",
    "grep is used to search for text",
    "The process number is the second column.",
    "I think it's just for bot testing.",
    "It's certainly better without the voiceover.",
    "tail ~jumblesale/irc/log | ~nossidge/chat/chat_log_pretty.rb",
    "I know, I cat'd it and you've got dome good options there.",
    "Yep. I didn't. I was just prettifying it.",
    "My version is now officially abandoned.",
    "I didn't export timediff. Ignore this fool.",
    "Isn't there some sort of TZ env variable we could use?",
    "That could be set in our ~/.profile ?",
    "All the other words are releatives/derivatices of 'world'",
    "Possible values are found in dir: /usr/share/zoneinfo",
    "So then all date stuff will be in your own time.",
    "You can see how I've amended mine:",
    "(Or you might be using ~/.bash_profile , I think)",
    "Are you not going to have it built in to mench?",
    "You could have an option to remove it.",
    "And an option to specify the time format.",
    "For Americans or peopl who prefer 24hr",
    "Could you do me a favour, please?",
    "The web ring code was broken for 2 days because of it.",
    "Or the system cron tables are in /etc",
    "Oh sure, I thought you meant the location of everyones!",
    "Like where is it saved on the system.",
    "I am here twice. I don't know why.",
    "Games were my rational for sticking with Windows too.",
    "But I don't really play anymore.",
    "Haven't played a game since Gone Home.",
    "I might buy a new SSD and use that for Linux.",
    "Didn't know there was a DF podcast.",
    "I always loved how in depth they get with the dev blogs.",
    "It's got a hell of a learning curve, yeah.",
    "You take a *fortress* for a bit.",
    "Then pass the file to someone else.",
    "I'll need to re-learn the game first though!",
    "Yeah, Therapist is pretty much mandatory.",
    "I've only ever played in unicode mode.",
    "You should probably be saving temporary files in /tmp/",
    "cd /var/ ; ~karlen/bin/menopt -s nossidge -h 1",
    "Well this script works :   ~/snowball/snowball_irc.bsh",
    "Hah, me too permission problem....",
    "jumblesale: Could you please remove the temp file:",
    "rm -f /tmp/irc_log_snowballs.txt.TEMP",
    "Just add `export TZ=GMT` somewhere",
    "Possible values are found in dir: /usr/share/zoneinfo",
    "I've edited it in my ~/.profile",
    "Is it still `~karlen/bin/mensch` ?",
    "cat: /home/nossidge/.mensch-temp: No such file or directory",
    "Also, it would be nice if -q was case insensive.",
    "I always rename mine to index.htm while I'm editing it",
    "If the server can't find .html, it reverts to .htm",
    "Damn, I've been there and it hurts.",
    "There was a guy with a forked beard",
    "Who said \"It is much as I feared",
    "And has stuck all these forks in my beard.\"",
    "He did it with all his limericks, it seems.",
    "The -f option accepts any text file",
    "You can use -v to set numnber of verses.",
    "And -l for number of lines in each verse.",
    "Yeah, I want to extend it to different types of formatting.",
    "So my index.html can be randomised every 5 mins or so.",
    "~nossidge/poems/poefy -v3 /home/jumblesale/irc/log",
    "But that's dreadful because of the timestamp, so:",
    "Now it's just dreadful because we're so unpoetic!",
    "Yeah, syllables and rhyming are something",
    "I certainly do want to add to it.",
    "Yeah, the piping possibilites are pretty cool.",
    "Always wondered what those were for.",
    "Now works with a regex filter.",
    "It's still not perfect, but I have to have my tea now.",
    "totallynuclear.club has their own radio.",
    "Here is the best Spotify playlist:",
    "/var/local/poetry/txt/leaves_grass.txt",
    "There's a lot of stuff in /var/local/poetry/txt/",
    "It is large, it contains multitudes.",
    "No, they were all there already.",
    "It's good to work together though.",
    "And leaves.rb is just a wrapper for ~nossidge/poems/poefy.rb",
    "So you could use poefy on any corpus.",
    "Well yeah, but it's still cool!",
    "It's basically a chat searcher now.",
    "Ah, damn. Actually it seems like it's still broken. Oh well.",
    "Are you making us a Twine game?",
    "That might be cool. So there'd be a repo for it?",
    "The Walt Whitman on my index.html now refreshes each minute.",
    "So it will be different every time someone views it.",
    "But then I have to include Java on the page.",
    "I just added something to it yesterday.",
    "This section should update every minute.",
    "I was going to ask you, is that an abuse of cron?",
    "Should I make it every 5 mins?",
    "Need to work on syllables and rhyming next.",
    "End of line returns only the lines that end with .!?",
    "Letter selects those that begin with a certain letter.",
    "And nothing does no filtering.",
    "Yeah, it just selects nice arguments for poefie",
    "I think it must be something. Nethack is tiny in comparison.",
    "It thinks that \"murmur\" rhymes with \"dwarfs\"",
    "Hah, I have Reading Gaol in front of me right now!",
    "Just the classics really, in dead tree form.",
    "Ooh, are we talking about Twine?",
    "Is there an overarching theme to the areas?",
    "Like Myst has separate islands.",
    "Would we be creating an island each?",
    "With it's own history and stuff.",
    "Then there will be a portal in my cave :-)",
    "How tricky would it be to port an existing twine story?",
    "Okay. Shouldn't be too hard to port.",
    "How do I do a <<replace>> macro in Twine 2?",
    "I was using  tilde.town/~Krowbar/twine2",
    "Is there an online 1.4 version?",
    "That page is great. How have I not read that?",
    "Is there a doc that says how I can add mine?",
    "Or even create mine from the desktop version?",
    "Okay, this now exists:  ~nossidge/ttitt/test.twee",
    "I wasn't sure how to do CSS and JS stuff.",
    "Boo.  No macro or passage called \"replace\"",
    "I guess the JS stuff doesn't work with twee.",
    "Would also work for a hash of events that have happened.",
    "/home/jumblesale/twine/build.py: Permission denied",
    "In the Twine desktop thingy you can just export it as Twee.",
    "There we go. Better title and authors.",
    "Enlighted us. I damand my MacGuffin!",
    "`set $items = {}` in the first room.",
    "Cool. We'll know now to avoid that.",
    "So I wonder then when should we declare vars...?",
    "Now you've made my brain hurt.",
    "Ooh I'm so close. Almost got rhyming built-in.",
    "cat ~nossidge/poems/rhyme_test.txt",
    "Load that to a hash and see how fast that runs.",
    "I don't know. Haven't written it yet.",
    "Also need the syllable count, in addition to the rhyme.",
    "I had to install the gem locally.",
    "vilmibm: Can you install something for me as root?",
    "vilmibm:  gem install --no-ri --no-rdoc ruby_rhymes",
    "Maybe once I've refactored the code a bit.",
    "7 * * * * ~nossidge/snowball/snowball_irc.bsh",
    "* * * * * ~nossidge/make_index.rb",
    "Does anyuone know if you can kick off a sleeping nossidge?",
    "I have to reboot and there's atill a zombie me here.",
    "Cool. I'll change my bookmarks to /Code/ then.",
    "Cool. It's not major, os not urgent.",
    "Well it's the same for me. Luckily I am my own worst critic.",
    "Yeah, now that would be a good use of it.",
    "Shouldn't happen again. I've added $USER to the temp file.",
    "I'm trying to make it rhyme at the moment.",
    "I'm on Windows. Connecting through Git Bash default.",
    "I've been playing a randomised rom on an emulator. So fun!",
    "I figured it would exist. And it totally does.",
    "But it is everything that a character or NPC speaks.",
    "It was important that you did.",
    "That's one of my other favourite things.",
    "I don't like the \"botton\" feel of most keyboards.",
    "It has to feel like a lever mechanism.",
    "When I press it I need some pushback.",
    "Do we have any database capabilites here?",
    "Or something else that's tiny.",
    "Everyone else: Sorry for noising up the ghost town.",
    "Which I hate, as you can tell from the code.",
    "It was my \"learn this language\" project.",
    "Nope. I work in data warehousing.",
    "A package called SAS is the database prog.",
    "I use SAS, Ruby and lots of shell stuff at work.",
    "That's okay! I'm not sure I've talked about my work here.",
    "I'll definately learn both at some point.",
    "I'm not sure what to say to that.",
    "No, I'm just rolling a really really simple one myself.",
    "It won't cut-up, just run on lines.",
    "It was my attempt at the old basic \\/ print thing.",
    "~rain and ~forkingpaths have the real mzes.",
    "Yeah, that's right. But his is a static text file.",
    "I use Processing for the pictures.",
    "The syntax is pretty much just Java.",
    "I got an IT aprenticeship instead.",
    "Yeah. Hull. Not a beautiful town.",
    "This was my first language at my job:",
    "Although I did manage to write a port of Pac-Man with it.",
    "Gosh. I've never been inspiring before.",
    "Thanks very much. I must say I feel similarly.",
    "One can not describe such things",
    "Here you go:   /exec -msg #tildetown haiku",
    "shuf: write error: Broken pipe",
    "shuf: write error: Broken pipe",
    "Do you play your upright more?",
    "I want there to be a JSON output as well.",
    "It's silly that it's a pure HTML table at the moment.",
    "Thanks. It takes a lot of custom site scraping.",
    "This is the first time I've seen you here.",
    "Busy with your awesome Pokemon randomiser?",
    "I've been playing it. It's great.",
    "I'm just tweaking it a bit and adding JSON now.",
    "Yeah, it's been broken since I joined!",
    "Yeah it's pretty good. I'm going to cron it every day.",
    "I think a latency of a day is fair.",
    "It's not going to be updated every day I don't think.",
    "Damn it.  ctrl-c.club changed their use list page...",
    "Just extract lines that begin with \"<li><a href\"",
    "And then grab whatever is between the href quotes.",
    "A JSON feed would certainly be easier, yes!",
    "But we'd have to organise it between tildes.",
    "Nope. You just missed us saying that the JSON feed is great.",
    "I'm going to switch to it in the list.",
    "We should make more use of the wiki.",
    "Not sure what to do with krowbar vs Krowbar...",
    "I'll go with your JSON dan. It skips uppercase Krowbar.",
    "Once they are, they'll come through in your JSON.",
    "I would go ahead and use/amend it.",
    "So perhaps send Ando an email?",
    "Espessially if it's in public_html",
    "Could someone test something for me please?",
    "It should highlight each user by colour.",
    "And alos hightlight your $USER name in the message",
    "test user krowbar test krowbar",
    "I'm testing a chat prettyfier.",
    "So: marcus nossidge marcus nossidge",
    "Hmmm. Doesn't appear to work on that last test line...",
    "Sorry Marcus, this is the line to run:",
    "I've been amending the chat log prettifier thing.",
    "tail ~jumblesale/irc/log | ~nossidge/chat/mensch_pretty.rb",
    "Wow. I just found a website that I made in 2006.",
    "It's about robots. It's the worst thing ever.",
    "I think I'm going to have to upload it.",
    "Okay. Don't just me. It was a decade ago.",
    "You can use -w to change screen width.",
    "It gets a sum of all ASCII values in a nick",
    "So it's the same for each name.",
    "Yeah. We can't write to files."
  ],
  "papa": [
    "There's a fortune server somewhere on the Net?",
    "I'm going to steal that snippet!",
    "does www.fortunefortoday.com have any other options?",
    "Then probably lunch, then maybe work on tilde scripts.",
    "\u0001ACTION bows before the master of tilde.town.\u0001",
    "Or do you prefer the title of Mayor? ;)",
    "Can someone check a web page for me?",
    "Take a look at tilde.town/~papa, please.",
    "Thanks for checking and for the opinion. :)",
    "Thanks. Inspired by the buildings used in Murau's Nosferatu.",
    "reppard: What's your SDF user name?",
    "The two are of the same spirit.",
    "SDF is big enough that there's fans of everything.",
    "I agree with you, now that I think about it.",
    "Fortune cookies and quotes tend to be accepted uncritically.",
    "Aw, TR's not bad. Cousin FDR was the devil, though. ;)",
    "Otherwise, just use the newest file with .html extension.",
    "Gotta switch to wifi. Hopefully see you on the flip-flop.",
    "I checked the mosh page. Too bad there's no Windows version.",
    "Guess I could try to install it on top of Cygwin.",
    "My stable includes Slackware (2), Ubuntu, and Mac OS 9.",
    "Ubuntu has pretty good driver support.",
    "vilmibm: Another reason I favor Slackware. ;)",
    "Ubuntu is succumbing to Microsoft syndrome.",
    "Endorphant couldn't handle all that existence.",
    "So THAT's what Pageant is for.",
    "I, for one, welcome our new component overlords.",
    "\u0001ACTION sympathizes with krowbar at 1:35.\u0001",
    "Not hard to massage output from find.",
    "Thanks for providing the setting for the geshtalt. ;)",
    "\u0001ACTION plays Perry Como on iTunes.\u0001",
    "Buta to yasai no nabemono o tabeta.",
    "The League of Extraordinary Hackers.",
    "No. But I should probably fix that.",
    "Then you must know the area very well. ;)",
    "My folks live in Westminster now.",
    "\u0001ACTION returns with bourbon. Happy holidays!\u0001",
    "It goes in the egg-nog tomorrow night. This is a test.",
    "\u0001ACTION nods enthusiastically.\u0001",
    "\u0001ACTION issues an official apology.\u0001",
    "More like many sheep stomachs if you're in Scotland.",
    "Indeed. And with great power comes great regexpability!",
    "heh. Flattery will get you anywhere.",
    "Enough damage for today. Be seeing you!"
  ],
  "pizzaops": [
    "home again home again jiggity jog"
  ],
  "potasmic": [
    "heyyyy it's me, khoi! Logging through the tunnel :D",
    "Wait are you sleeping now? I'm confused :o",
    "ah I thought pub was meant to be \"public\" or something :P",
    "This is me through the SSH tunnel",
    "potasmic = khoi! hehe Not so hard to get!",
    "Oh it's the API from my site. anime stuffs",
    "Basically fetches upcoming events in a calendar.",
    "Planning on building it here :)",
    "state of the internet? :o what's that?",
    "Oh so you're new to *nix, too?",
    "right. I'm not a essay-person haha",
    "So Tilde places bring the good'o feelings back?",
    "fun again sounds better than less sucky lol",
    "dhgwilliam, incredible guess hehe, southwest to be exact.",
    "But I just have a few text files? why is it too much",
    "Yes, it's hot and humid. Not that comfortable,though!",
    "Get some sleep to make up the jet lag?",
    "I think I even up-all-nighted on the arrival trip.",
    "Coming back was just like dying.. You just fall onto bed.",
    "I'm pretty sure he's still running",
    "oh wait, I haven't implemented that.",
    "I just killed my app and both are gone at the same time lol",
    "plz don't clone plz don't clone",
    "I don't know what's generally wrong about this.",
    "yeah :/ I'll spend time on this",
    "I'm pulling from GitHub to Tilde to see if it works on nix",
    "apparently, how do you require the module in nix?",
    "Not really, the repo is 44KiB overall",
    "216KB actually, that was Git compressio",
    "*nix escapes line-break as \\r and my Win7 is \\r\\n",
    "^running through win > tunnel > tilde",
    "eol.... end of line... oh oh yes! haha",
    "oh my gosh, finnaly got it working on Tilde",
    "how do I remove a repo in tilde in the cli?",
    "Now it's compatible across OSes \\o/",
    "still the same, takes a regex, takes a processing script.",
    "lol, it's cartoon ships. I'm (almost) an anime person.",
    "Not exactly, something different.",
    "That ship module is for a channel on a different network.",
    "But that prooves we can tweet in IRC! :D",
    "maybe !tweet:[content] here would be nice!",
    "I wonder if I'm able to do bash script in node.",
    "Too many time to set up twitter account :/",
    "Maybe I'll just do test echo or something like that first",
    "Is there a way I can tweet in one line?",
    "oh wait you've already built that?",
    "I'm afraid of people hacking it, too D:",
    "Currently, I only wiped out the pipes.",
    "Or I can just filter the tweet with only [a-zA-Z_-()]",
    "Or I can just filter the tweet with only [a-zA-Z_-\\(\\)]",
    "and grep basically highlight stuffs?",
    "I'll implement a function where I can kill it through DM.",
    "I didn't know there's #programming hehe"
  ],
  "rain": [
    "I would have preferred \"Dessert of the Wrath\"",
    "It must be - it says so right in the title"
  ],
  "reppard": [
    "selfsame: your ~ page is awesome",
    "later all, i'll be back to work on my ~ soon =)",
    "this makes me want to revisit my irc client written in ruby",
    "we got room for a silly bot in here?",
    "I should probably throw him in my Code folder",
    "meh, the quotes are kinda lame...but its a wip",
    "testing one more thing and then its bed time",
    "damn I love ruby and restful api's",
    "alright im done for the evening.  good night everyone",
    "what are you guys trying do?  I may be able to help",
    "I made a dumb bot last night.  norbot",
    "its pretty simple. /home/reppard/Code/norbot.rb",
    "theory of everything is great too",
    "that was a fail. lets try again",
    "I sorta broke away from the unix single responsibilty thing",
    "\u0001ACTION looks to either side of himself\u0001",
    "apparently there are only 2 bots!",
    "he could loose the present bit now i guess",
    "im gonna put all the bots on one line",
    "day changed?? where is this thing hosted?!",
    "i wanna think of something else to build",
    "whats up with puppet always running?",
    "i'd like to contribute more to open source",
    "I'd rather just use r10k and create my own configuration =\\",
    "that is just a fork of 'boxen'",
    "which i hear is pretty awesome if you are running osx",
    "its waiting for nodes to check in",
    "master compiles the catalogs for remote nodes...and itself",
    "is that jsut from running puppet apply?",
    "yeah the hostname looks jacked up",
    "been a while since i configured a barebones system",
    "what are you testing your config on?",
    "i think master is just a sub command",
    "so it would just be the puppet binary",
    "im gonna have to bring up vagrant and tinker =)",
    "according to that it should be supported",
    "yeah modules are usually pretty package manage specific",
    "apt and yum are usually covered",
    "so you could probably write your own ircd module",
    "yomama has been pulled from the featuer list =)",
    "lets see what puppet is up to this morning",
    "you could do it pretty easily with ruby",
    "I need to play with python more",
    "but i just wanted a working bot at the time",
    "Id like to clean up that process line method",
    "um: you'll learn, you are in the right place!",
    "haha that sounds like a great idea",
    "I think I'll build a dashboard",
    "i'll mess around with it later =) g2g!",
    "lots of bad inline js but it works =)",
    "cat /home/reppard/Code/radiator.rb",
    "thanx um that does look better",
    "haha read 'Refactor Your Wetware\"",
    "alright ya'll im out for a bit",
    "yeah is it telnet or something?",
    "has someone started a tilde.town web ring yet?",
    "how often is the list updated?",
    "Last updated on 2014-12-22 at 02:00:08, GMT+00:00.",
    "did you see the radiator i hacked together?",
    "styling is not my strong point",
    "if you do 'nc -z localhost 22' it returns no output",
    "yeah i started to read how he set it up",
    "guess it'll just have to be red on the radiator =\\",
    "atleast it let me test my logic =)",
    "I tried just pinging each box but like half of them failed",
    "haha i should hardcode their port",
    "what does (default :3) refer to on the homepage?",
    "yup, and if you used htop it is probably number 1",
    "puppet master running all the time really gets on my nervers",
    "night all, gtg.  happy hacking!",
    "wait a sec, is that the final episode??",
    "been waiting for that, thanks for the heads up!",
    "not sure what that is but it looks to be automated =)",
    "someone posted a great article in my teams hipchat room",
    "I should be at work...kids are sick so i took pto =)",
    "yeah I remember playing hooky as a kid",
    "i'd play FF7 or Shining Force all day long",
    "I want to build a CLI game with ruby and curses.  any ideas?",
    "based on the C ncurses lib i believe",
    "irb(main):001:0> require 'curses'",
    "yeah I've got some spring cleaning to do as well",
    "figured someone might have fun with it",
    "I still need to use canvas and add export functionality",
    "word of advice, avoid getting the flu everyone",
    "two of my kids had it...now i have it.  no fun for anyone",
    "or christmas depending on where in the world you are",
    "i see the issue.  it doesn't account for people using mosh",
    "I just finished up some last minute wrapping",
    "i know next to nothing about canvas",
    "^^ if you ever get the urge to view some terrible jquery",
    "all the protips i read came from the 'pick axe' book",
    "thanks for the tips they are much appreciated",
    "time for sleeps.  merry christmas all",
    "I signed up for a few and this one is by far the most active",
    "oh man, seems to be a theme with those fortunes today",
    "have at it =)  all his code is in /home/reppard/Code",
    "haha, getting a little on the low side",
    "It just calls down to fortune on the command line anyway",
    "does fortune take any arguments?",
    "not sure that sed regex is correct",
    "brb, gotta close this tmux session",
    "he'll be back in a minute papa",
    "scp index.html jmml@tilde.town:/home/jmml/public_html/",
    "hmm, try without the jmml@ prefix",
    "scp should use the same key you have for ssh",
    "you are trying from your machine right?",
    "if not then you need to specify the key",
    "so you could do scp -i <pathtokey>",
    "you have to pass the private key",
    "I think i'm gonna try my hand at pixel art",
    "learn you a haskell for greater good?",
    "I love that little 'holy shit!' sun",
    "also messing with some pixel art",
    "actually nethack has some great visuals for being all ascii",
    "hey look at that, no puppet master",
    "hmm, agent and master are both running",
    "just not at 23 percent per usual",
    "morning full of legos and coffee",
    "emacs?? haskell??? don't torture yourself!",
    "I saw earlier that you were on sdf.org",
    "one of you guys wouldn't mind validating me would you ? =)",
    "indeed i seem to be validated.!",
    "yeah i've mucked around on those",
    "i need an arpa membership so i can use screen",
    "then I'll spend more time on there",
    "i was surprised to see a raspberry pi forum on the bboard",
    "awesome! i can finally change my default shell",
    "you really take things like tab complete for granted",
    "krowbar[work]: that was poetic =)",
    "and actually that is how reppard is pronounced",
    "audiodude: those processing creations are aweome",
    "i waws just looking into processing this morning",
    "kc: finally started reading those tuts on canvas",
    "nope, i literally just started =0",
    "i did make ~reppard/canvas.html",
    "unity makes me want to punch small animals",
    "ubuntu unity just for clarification",
    "sadly it seems to be the best option for HiDPI",
    "yeah i'm speaking of the default windows manager for ubuntu",
    "went back to ubuntu for more out of the box support",
    "alright time to feed the kids. til later everyone",
    "got a whole mess of those too =)",
    "I gave your artwork a link on my ~",
    "did you put the source up anywhere?",
    "oops had it in the wrong section",
    "view source...hidden in plain view",
    "I half expected i'd need to jump into some js files =)",
    "i've played around with pygame before",
    "wrote a very basic tic tac toe game",
    "some pretty hacky jquery to build that table",
    "butterfly catcher runs very well",
    "the code looks nice and clean too",
    "dot notation is a beautiful thing",
    "but the array index starts at 0",
    "I \"saw\" an undefined.  it showed up as a black sphere",
    "nice! i play the 90s alt rock playlist at work sometimes",
    "im considering purchasing one today :)",
    "i've historically been more of an android guy"
  ],
  "rklett": [
    "^ a glimpse into what keeps rklett up at night"
  ],
  "robbymeals": [
    "i have been applying to phd programs so not been on in a bit",
    "i am a senior machine learning engineer at a startup in dc",
    "somehow it will pull my entire life together"
  ],
  "ryan": [
    "hey, just joined, checking this thing out"
  ],
  "sameself": [
    "is rollcall a command, selfsame?"
  ],
  "sanqui": [
    "BUT I have some more time now so I've come to check in!",
    "ha!  yes, I've been fixing a lot of bugs in it",
    "hope your game doesn't crash anywhere, haha",
    "oh!  I have kind of abandoned my list, yes",
    "I agree that a standard is necessary",
    "that's over twice the number I remember",
    "oh my script doesn't run at all",
    "oh boy I probably have a crapton of mail",
    "somebody wants to connect the tildeverse to hyperboria",
    "well, when I did it the users were rising pretty fast :p",
    "the neo geo pocket color is pretty cool btw",
    "it was japan only, but really good",
    "I'm waiting for 1.0 to learn rust"
  ],
  "selfsame": [
    "well we put cocktail hotdogs in it",
    "testing the new mud version.. telnet localhost 5071",
    "played a bit of the twine, good stuff!",
    "mud server should be running from now on",
    "hmm.. we should have a generic bot rollcall command",
    "uhg i am not a good bot scripter"
  ],
  "ssteinbr": [
    "Would anybody be able to help with ssh problem I'm having?",
    "haven't messed around w/ cron in a few years"
  ],
  "tdsmith": [
    "that's the one with jar jar binks right"
  ],
  "temmon": [
    "Ever have one of those days where everything is failing?"
  ],
  "um": [
    "except to merge your pull requests or start a new remote.",
    "dan: I don't mind working through the github tutorial.",
    "s/projects/project--referring to ~ring.",
    "and maybe that's as it should be.",
    "That's not a bad thing, of course.",
    "kc: it's a great question and an important problematic.",
    "It sounds like by \"math\" you have \"applied math\" in mind.",
    "which certainly would be the domain of \"most math students\"",
    "ah! I see! that makes good sense to me.",
    "somewhat the difference between engineering and mathematics.",
    "dan[afk-lunch]: which is immortalized in the quote database!",
    "That way I could do !quote-apropos hate",
    "and get your immortal words back.",
    "It doesn't bother me, I'm just over-sharing, I guess :)",
    "oy. if you need me to get your back in fight, I'm on it.",
    "dan: still, I got your back, regardless of the facts too.",
    "dan: I didn't make the changes.",
    "I fucked all that up before starting tomake any cahnges.",
    "I got your back, you can have my contacts.",
    "this is a safe space for whinging, I hope.",
    "maybe I should get with the mosh thing after all :0",
    "I see. Write code to fail in multiple ways!",
    "That's why its working for me.",
    "sorry to hear about the trouble.",
    "nevermind. I should just open a repl.",
    "marcus: Do you know, btw, if Erlang is homoiconic?",
    "jumblesale: yep! I'm mid way through \"input and output\".",
    "All the lectures are posted by the same youtube account.",
    "I'm looking at your link now. Thanks!",
    "Awesome!, jumblesale. Psyched to see what appears :)",
    "That's from Stockholm in the late 19th century.",
    "marcus: Ah! Do you use Erlang for your work then?",
    "\"Interrupting Winston Churchill.\"",
    "karlen: I know, it's been almost 24 hours!",
    "karlen: I'm not sure about the time, tbh.",
    "I only know SO from the internet too.",
    "I like it, or \"partner\", for the gender neturality.",
    "karlen: ah! that makes sense. I hadn't thought about that.",
    "that's funny, and very descriptive.",
    "Exciting! That should be great.",
    "Just you can add in the \"next ~user\" link if desired.",
    "I'll post to usenet when it's up.",
    "It'll really only be helpful if everyone uses it.",
    "Just for the sake of fun browsing.",
    "karlen: I don't the js for that is up yet?",
    "Oh yeah, I remember, that is up!",
    "Looks like. I'm not sure how to disguard that.",
    "But I need something meaningful to tweet.",
    "marcus: crap, that means I really need to focus.",
    "aight, i'm out for a bit. Take care all!",
    "not much, in late reply. see ya!",
    "Then sometimes they'll scroll through the log and chime in.",
    "I linked to the wikipedia article, i think?",
    "It was coined to be the antonym of xenophobia.",
    "I guess those sorts of changes happen very slowly.",
    "Set bash to use vim keys at the cli instead of emacs keys.",
    "So I guess the channel is just tilde.town?",
    "Lots of helpful stuff there (not all mac specific).",
    "Bummer! Have you upgraded any of the components?",
    "(I put new ram in my 2011 mbp a year ago).",
    "cammikebrown: huh, I don't know anything about broadwell.",
    "Do you think I should go ahead and merge that branch?",
    "dan[work]: well there's no hurry!",
    "Karlen already has the next ~user link up.",
    "I'm shit with for loops though.",
    "We're all making tilde.town :)",
    "oop, sorry, I meant to be sharing that with dan.",
    "Oh yeah. I'll merge right now. I'll report back when done.",
    "Cool, I think we're good to go.",
    "I guess it's not a big problem.",
    "But I'll try and implement it better when I get a chance.",
    "I agree with you about the internet.",
    "I just can't decide if it's a good idea.",
    "yeah? I bet jumblesale will get on it then.",
    "dan[work]: that is a great idea.",
    "neat, I'd never heard of Gopher",
    "oh crap, that's embarrassing kind of...",
    "I've been using slrn for the newsgroups",
    "what sort of work? At the zine library?",
    "Am trying to study some now in the wee hours.",
    "I saw you're irc victory tracker (j/k).",
    "what is the reference/#irc file? Just the irc log I guess?",
    "\"/home/karlen/mensch: No such file or directory\"",
    "sweet! I get to see everything jUMblesale says.",
    "Not a thing around here, jonno.",
    "I started watching it at some point. I should finish!",
    "\"functors are a thing that works with fmap\" right...",
    "I don't know if that's accurate though!",
    "Again, I don't know if that's right.",
    "An arrow maps one object to another.",
    "That thing is a category called 2, apparently.",
    "A functor maps one category to another.",
    "We have reached the limit of my understanding! :)",
    "Okay, I think I have a crappy concrete example...",
    "I hope you all have wonderful days.",
    "Because it shows up in everything?",
    "but because that shows my naivet├® regarding parsing.",
    "*not to suggest that you're approaching it incorrectly.",
    "maybe it would be easiest if I just change my name?",
    "j/k, glad to pass the torch :)",
    "Those squiggly hands remind me of my childhood.",
    "I just got caught up on XIV - XIX",
    "How old are you, dan, if you mind me asking.",
    "XIV reminded me very much of my self about a decade back.",
    "this is a real 'raint' moment on the lattice of coincidence",
    "ooo, ~nossidge's thing is awesome.",
    "yeah, nossidge's page is awesome.",
    "karlen: I ran the commands you asked me to.",
    "dang. I get nothing for ~kc/active.html",
    "Is firefox just slacking or what?",
    "maybe it's just broken, or using chrome-specific stuff?",
    "what do the dots correspond to?",
    "Looking neat though! Sorry to jump the gun.",
    "They don't know if the links go to audio or video or what.",
    "I guess \"listeners\" might cover that...",
    "we were all admiring your page just a moment ago.",
    "to which um replied \"ooo, ~nossidge's thing is awesome.\"",
    "yeah, the whole this is really working great.",
    "what kind of programs are you applying to, robbymeals?",
    "did you do CS in undergrad too?",
    "Well, fwiw, I support your decision!",
    "I would do the same if I were 5 years yonger.",
    "you're 5 years younger than you'll be eventually!",
    "what! quote's taking arguments :)",
    "dang, you just got lucky karlen?",
    "nossidge: did you see my guess at the riddle?",
    "not surprising since I don't know python :)",
    "If I get hung up, I'll try it in python.",
    "dan[work]: what languages d you work in most?",
    "ah, but you're picking up functional langauges?",
    "I think Python is \"mixed paradigm\" with an OOP base.",
    "python is all statements, right?",
    "as opposed to, e.g., Scheme, which is al expressions?",
    "kc: that's a very nice, very liberal definition :)",
    "I'm pursing a similar silly hope.",
    "I've heard that it's similar to Prolog in some ways.",
    "robbymeals: good for kc indeed.",
    "I'm going to head out myself. See ya, kc, dan, everyone.",
    "What makes mac and cheese delux?",
    "Oh yeah. That's deluxe alright.",
    "why is there an apostrophe there?",
    "why prefix the log with a hash?",
    "kc: but what if it gave back the results I fear are true!?",
    "What is the thing you're using?",
    "wow. you wizards work up stuff so quickly.",
    "I seem to have run into some problem with user space.",
    "I think we have like 20 mb.  Although it could just be me :)",
    "especially given the intent of keeping this a free place.",
    "Wow! still growing pretty fast.",
    "any of those three seem plausible.",
    "Coolest if it is the \"dysfunctional programming\" language.",
    "ah. that was a command to run?",
    "I don't know what a nyancat is--to google.",
    "Looks like, according to wikipedia.",
    "Apparently this will also work to !:quote",
    "Apparently this will also work to :!quote",
    "I'm glad now to have time to check in on the town irc.",
    "vilmibm: Good, as always. I love that city.",
    "But cabal first needed to update its package list,",
    "when I ran that command, it ate up all of my user quota.",
    "First thing it did was make a 23MB file. :)",
    "(Unless there's another way of getting things working).",
    "I am an Ordained Minister of American Marriage Ministries.",
    "There's plenty of other stuff to do.",
    "Yum microwave indian curries too.",
    "dan: Good and good for you! I won't be a bother then :)",
    "Long time! I hope you're good :)",
    "Or \"well\" if that's the right one to use.",
    "I'm the worst (speller in the vicinity).",
    "Yep! And patiently documented too!",
    "Granted, I probably understood what I was doing 3x better...",
    "Sweet! I'm looking forward to reading it.",
    "Yes! I want that functionality too.",
    "That's what it's called now :)",
    "okay---that's it. I'm going to the food cart.",
    "Do you work with vilmibm etc. ?",
    "Are you all on crunch time with some big project?",
    "At the command line. Or shredding paper docs?",
    "Or using a gui to delete digital things?",
    "I'm showing my partner that video. She's gonna love it.",
    "That was an excellent video. :)",
    "I'll be back in a few moments.",
    "I think it's a feature of quote_bot",
    "Do we have a fortune cli command?",
    "I guess there's still room for lots of bot-building!",
    "Someone has a command that will pull down wikiquotes",
    "Looks like a job for a usenet post or an email to vilmibm.",
    "Ah! b12. That's a good type. I see :)",
    "shanx_: but then we have to metabolize that too...",
    "True. It's between me and my past and future selves.",
    "vilmibm: I quotes and tweeted you via tilde.town",
    "(Of course, I'll set it free again.)",
    "Seriously, though, thanks for those words and you're right.",
    "Is it from... what, Paris Spleen?",
    "I need to human-up and read that.",
    "anovak: Cf. Hamsun's \"Hunger\" :)",
    "Yep, I could have just not pressed enter on that one.",
    "Yep! And everything was fire and strife at the root.",
    "At least, that's what I had in mind.",
    "I want to be tweeting like every 8th remark in here tonight.",
    "That means I've been spending too much time on twitter.",
    "I hate how the mediums warp my mind.",
    "Of course, it's a matter of perspective, as you say.",
    "We're fire destined burn to tiny rocks.",
    "anovak: yes, and more widely, animal experience.",
    "Also of Nietzsche's \"Last Man\".",
    "We can agree to disagree on the aesthetics of titles :)",
    "What's a title for a work of philosophy I like...",
    "How about \"Basic Problems of Phenomenology\"",
    "Or \"The History of the Concept of Time\"",
    "\"The Metaphysical Foundations of Logic\"",
    "So maybe you can find something in Heidegger after all :)",
    "Not that he's the first to originate it.",
    "But ideas take a long long long time to get worked out.",
    "Why do you think we're so intractable?",
    "\"Be the philosopher you wish to see\"",
    "I share your skepticism, and cynicism.",
    "True, and that is founded on oppression and greed.",
    "I feel generally uncertain and hesitant.",
    "Then I end up not willing to burn shit down.",
    "I agree: if we have such a standard.",
    "And many things *are* pretty black and white at this point.",
    "Oh those are excellent points, I think.",
    "Without any qualification or exceptions.",
    "So X isn't a variable term there?",
    "Here's a good title: \"Against the Day\"",
    "I'm pretty sure tennability doesn't go above 11.",
    "Then we can just enjoy the endless night.",
    "joe: nope, we're talking philosophy--mainly ethics.",
    "first: \"smartness\" isn't worth shit on its own",
    "I'll be back around in awhile, if you're still here.",
    "So joe's will be included next week?",
    "I can come up with one, probably.",
    "If I am too late, that is just fine.",
    "I don't know if it's well advised",
    "But, point being, i registered lambda.land",
    "I'm thinking, it would run on NixOS",
    "I'm thinking a functional free for all.",
    "tilde.town is fantastic as it is, and I want to be here.",
    "(loosely speaking, probably!).",
    "vilmibm: It might be fun, right?",
    "vilmibm: you have a tilde.club page too.",
    "Yeah, but, *shrug* is a good point.",
    "But then do I just become a voyeur?",
    "Cool! I should be pretty flexible.",
    "(sorry, just trying to figure out jumblesale's bot).",
    "You mean not-sleeping is a wonderful way to be drunk?",
    "Or you're really speaking of gameboy?",
    "It's on my \"to listen\" list now.",
    "I imagine it's pretty straight forward.",
    "sorry, that request was aimed at jumblesale.",
    "Because mentions isn't added to the repo.",
    "And the program will expect output to be there for it!",
    "vilmibm: plus the code is easier to write.",
    "I'll branch then make a pull request.",
    "where's home, maja? (if you don't mind me asking)",
    "Home.... like where I'm truly at home?",
    "It heads a chapter in Goldblatt's \"Topoi...\"",
    "I'm just started, but it's fucking fantastic.",
    "That wil help me learn and love it better.",
    "I guess that is a problem with living a \"cool\" place.",
    "It's possible, but I didn't study for very long.",
    "maja: I think Manhattan is like that too.",
    "I guess it's the price of being a cool place.",
    "Das habe ich nat├╝rlich verfehlt. :_)",
    "I don't know if that was intelligible!",
    "Toll! Wit haben uns ein kleine Stammtisch!",
    "Die Deklination und Genus kann ich nicht schaffen.",
    "fearlessbananas: I'm curious: what's a thermostat code?",
    "fearlessbananas: makes sense! I like that I know it :)",
    "Right! That seems like a pretty great benefit.",
    "Cool stuff! That'll take me awhile to dig through and grok.",
    "Wow. Lattice of coincidence all over this piece!",
    "Too many quotes around that one :)",
    "uh... maybe I didn't pull right.",
    "I just did 'git clone [repo]'.",
    "Then the person would look it over, accept, then merge.",
    "good night vilmibm! thanks for the chats and poetry!",
    "Let me know when you have an idea about a brooklyn rendevouz",
    "jumblesale: if you'd rather I fork, I'm happy to.",
    "Yeah, it's running, but i can find the channel",
    "Or, it doesn't show up in the channel.",
    "It's running on the command `./quote_bot.py -c \"\\#test\"`",
    "nice! That I am command-tabing like every 20 seconds.",
    "My partner and I are both night-owls by inclination.",
    "And I'm unemployed and she's on break from uni.",
    "And we just got back from a trip to the west coast.",
    "So all those have compounded our natural tendencies.",
    "But people are just different and weird and I think.",
    "I don't understand the details.",
    "Or, like data did with Lal, let them pick?",
    "I think you use spaces not tabs right?",
    ":) You're going to japan very soon, yes?",
    "I'm a sucker for inter-species friendships :)",
    "She said that's were she got it :)",
    "It was fun! I officiated a weeding.",
    "There was lots (too much drinking).",
    "I'm still just figuring out how to parse the line.",
    "Sorry for my super crappy punctuating. there",
    "Huh... I'm using this: `text = msg.split(' ',4)[4:]`",
    "We're working on jumblesale's irc bot.",
    "jumblesale is learnin' me stuff.",
    "jumblesale: that's what I have in mind, yeah.",
    "karlen: Imma make it tweet from irc",
    "I think I can envision all the steps.",
    "It's just a matter of figuring out the python idioms.",
    "So lots of SO and blindly mimicking jumblesale's code.",
    "Actually, just little bits, cause there's not much to it.",
    "I added some buggy features to frs's and dan's projects.",
    "as does imperative programming.",
    "That's probably a good reason to learn it :)",
    "I isolated the text after the bot command.",
    "I registered \"lambda.land\" for the purpose.",
    "Then you might know 'em already!",
    "Funny that you feel embarrassed to admit that :)",
    "Not all the radiotopia casts are that great, imho",
    "I can't get into \"Strangers\", I don't like it.",
    "The best, is probably Fugitive Waves",
    "99% invisible is the most fun.",
    "I heard about tilde.club stuff from Theory Of Everything",
    "I knew I'd meet a fellow TOE initiated before long :)",
    "I listen to \"Thinking Allowed\"",
    "karlen: those are one-offs, right?",
    "On the Media is a great media analysis show from WNYC",
    "Ah! Is that how you got around the ubiquity of um too?",
    "karlen: have you heard \"Here Be Monsters\"?",
    "It's a pretty interesting one.",
    "\"Everything Is Stories\" is pretty dope.",
    "Should I do \"> /dev/null 2>&1\"?",
    "What os do you usually run khoi?",
    "Okay! I'm useless then :) Hope it goes smooth.",
    "But I didn't know I was making a redundobot!",
    "Maybe quotes will break this one too.",
    "I'm just hacking jumblesale's quote_bot",
    "That saves me a google! Thanks :)",
    "Cool. I'm pretty sure it's good to go!",
    "So maybe I should have forked?",
    "I can do it another way too! I can fork and then copy paste.",
    "Or if I'm just missing something.",
    "That show is great, by the way.",
    "That's what I should have done :)",
    "Next time. If you uncontribute me, that's fine!",
    "Then I'll fiddle more down the line.",
    "You know, for function input output.",
    "Also, It seems like pink is bigots repellent.",
    "What languages do you work with?",
    "I doubt I'd be able to grok much of the code.",
    "You work in machine learning right? Mostly in C++?",
    "And lips has virtually zero syntax.",
    "But, again, a muffle that under a heap of salt.",
    "I was at my friends wedding party last weekend.",
    "I was doing show and tell with your page.",
    "Maybe it's more like a generator of fragments of labyrinths?",
    "Oh! I think I saw an example of that on ~selfsame's page.",
    "But I imagine I could puzzle out the intent of most lines.",
    "They were crazy about caps lock in those days.",
    "um: Sweet! What language are you using to generate the midi?",
    "How's your thermostat holding up?",
    "Did you have an okay trip back home, maja?",
    "I think that was a good choice.",
    "I keep thinking of good reasons why that is a bad idea.",
    "yep, seems easy with python too.",
    "I think that's about the language, no dis to jumblesale.",
    "Everything looks nice and encapsulated in your ruby stuff.",
    "Yes! That a good command to have! quote-bot needs that too.",
    "Happy to be here and I am learning!",
    "reppard: care to give a preview explanation?",
    "Going on a walk and to eat some breakfast in the park!",
    "Pretty good over here too! Are your finals wrapped up?",
    "What's the allure of Craigslist?",
    "Yeah, that's generally my motivation for things :)",
    "I installed the haskell platform from haskell.org",
    "(standard for haskell, I mean)",
    "what is a highschool kid doing buying drano?",
    "Too on top of things... -- I mean, admirably so, of course.",
    "dang, nossidge: that's fantastic. Afternoon well spent!",
    "thanks reppard, I needed another tab open :P",
    "I'm hitting sleepy stuff. Night, all.",
    "fearlessbananas: do you know thinks about unix stuff?",
    "hi, marcus[away]! How's Japan?!",
    "Oops. How did I read that as \"kalen\"?",
    "Sorry <*embarrassed face emoticon*>.",
    "the suspense on this drano mystery is killing me :)",
    "kc: do you still live with your parents?",
    "krowbar[work]: what do you mean?",
    "I'm actually surprised my ssh connection didn't drop...",
    "Sorry for the trivial details.",
    "Maybe I should also make piece with irssi",
    "I'm just parroting what I think I've read.",
    "But I might be misinterpreting it.",
    "Whoops, I was on the bd wifi. Sorry if I missed something.",
    "audy has the list of stuff in dirs named Code",
    "But that's not practical for stuff like ~dan's json feed.",
    "The wiki! That's the place for things, isn't it :)",
    "Like `addresource filename \"this does thingy\"`",
    "So the cli program to read and edit the wiki?",
    "what, you're saying we have that :)",
    "I wonder what else the front page is listing?",
    "Oh yeah, what's up with that? seems to be the same person.",
    "so many questions... like, what is unix?",
    "you preempted my further questioning.",
    "Ah lucky me for musing on that in this moment.",
    "audy: what are you going to graph?",
    "audy: probably not, but I'm gonna try!",
    "If not, I'll switch to Ubuntu.",
    "Given that, it seems like playing with NixOS is fitting.",
    "It's inessential to the main intention though.",
    "Could you virtualize that on an ec2 instance?",
    "just reading your email, audy.  Thanks!",
    "Not i. never haven't even heard of it. (reading now)",
    "coaxial: looks neat. What are you using it for?",
    "That's really cool, and really sweet.",
    "Good thing I didn't get around to trying it!",
    "nope, though I saw that somewhere :)",
    "Pretty sure that's what they use.",
    "Actually it's /home/karlen/bin/mensch",
    "I could try out the difference.",
    "(I mean, jumblesale uses the bin/mensch in his python)",
    "dan: how are things going at sunburnt.country?",
    "I've heard of it, but never had to encounter one.",
    "It always sounded more mysterious than that! :)",
    "Right, one of those lovely atavistic terms.",
    "Like \"path\" or \"core\" (as I recently learned).",
    "zvxf jvxf? Weird flags to use.",
    "'b' and 'g' would seem to be good options for those :P",
    "dan: Am listening to santa story.",
    "(If I can count the Flying Concords) and some nice films.",
    "And youtube videos of the Haka",
    "I had been watching \"Please Like Me\"",
    "Know him personally, or as an Australian celebrity?",
    "The UK has tons of those too, it seems.",
    "Tildes! ( I didn't need the leading dot).",
    "morning! How are things in your neck of the world?",
    "reppard: Both are purely for pleasure :)",
    "I'll be around intermittently for another 45 minutes or so!",
    "I was just looking over your page :)",
    "Ah. I see. Denver is my hometown. Thus my nosiness.",
    "I'm crap at locating places in space, actually.",
    "I even thought about trying to make it :)",
    "And that's a lot of thinking for someone as indolent as I.",
    "papa, marcus: your commiseration is noted and appreciated.",
    "endorphant: Yes, that's what I want out of them.",
    "marcus: What's the first game on your plate?",
    "marcus: Sounds like fun stuff--all of it.",
    "Nice! \"The Probe\" looks like a fun project.",
    "marcus: I group on the Square-Enix jRPGs too.",
    "That's what you were off doing when you were so quiet :)",
    "But there's probably a better, longer resource somewhere.",
    "Also, those aren't necessarily going to be good topics...",
    "Oh! That's we couldn't get it to work in the test channel!",
    "nossidge's robot page is adorable.",
    "How many do I have to do before I get my berating?",
    "I'd definitely go the week with changing clothes.",
    "(although I do like fresh undies).",
    "I've done it, and it's kind of gross.",
    "krowbar[work]: gross and very funny.",
    "marcus: that's a respectable rational!",
    "marcus: If I can help, let me know!",
    "Any reason I should route it through the epoch stuff?",
    "Of course, I'm sure there are folks here who can help more.",
    "kc: I sympathize. What do you hate about it?",
    "kc: I am finding it very instructive.",
    "I think it is indeed a restraint",
    "Neat! I didn't know that about Scratch.",
    "I have to run! Nice chatting with y'all.",
    "Happy new years eve eve, town!",
    "That makes me weird--I get it.",
    "Instead, I'm like a yammering fool :)",
    "karlen[afk] is in Japan visiting his partner, I believe!",
    "I don't like the sound of this:",
    "that once again he did something wrong",
    "But I see that is part of the point of the book.",
    "Revisiting them at 8 can be a bummer.",
    "Are you baby sitting, or just hanging out with her",
    "Similar age difference as between you and and you sister.",
    "I wish I had spent more time with them than I did :)",
    "I can help you with a prompt, surely.",
    "Too many to feel comfortable picking from?",
    "Should be a pretty quick task.",
    "pandoc -f html -t markdown hello.html",
    "\"To convert hello.html from html to markdown:\"",
    "remove the \"der\" and that's my state.",
    "Funny it's that deeply worked into my brain ;(",
    "There's probably like a 1mb python lib that does the same :)",
    "Us olds have trouble emojing correctly.",
    "Welcome to the east cost endorphant!",
    "In case I don't encounter you tomorrow, kc, happy new year!"
  ],
  "vilmibm": [
    "because it's how i roll i guess",
    "^_^ and now it's 4am and i need to sleep, so good night :)",
    "I was out in a garden all afternoon",
    "then watched a movie and drank and hung out until 3",
    "then I was at last back at my computer :)",
    "so uh don't thank me too much I'm kind of a deadbeat",
    "i had nightmares about tilde.town last night",
    "imt: eh just a few seconds honestly",
    "I just need to deputize some sysadmins to help",
    "i feel like i haven't been here in forever",
    "Krowbar[work]: yeaahhh fuck sorry",
    "I have to make you a new user account :(",
    "I thought I fixed the signup form to prevent uppercase names",
    "so basically just tell me a new name",
    "and I'll move your ~ dir over and chown it for you",
    "word, I'll do that in a few and let you know",
    "Krowbar[work|afk]: ok, I'm copying your home dir over.",
    "(and nope you don't need a new ssh key)",
    "psa: if you really want more quota, just ask me",
    "actually all of these things are rad",
    "just sounds like a lot at once",
    "do you live on the west coast? or are you a NYCer",
    "um: yeah I was worried ghc might be rough",
    "um: and rad, are you a religious official of sorts?",
    "like a batteries included type package",
    "we can fit it, i'll look into it",
    "we lost all those gigs to puppet repots",
    "which i deleted with extreme prejudice",
    "dan: i <3 my Nook Simple Touch",
    "but i'll look into it tomorrow",
    "rn i'm trying to figure out what to eat",
    "or walk over to the late night food carts a block away",
    "did some unpacking / setting up of the things",
    "haha word, later um_gettingfood",
    "i realized my TV literally has youtube",
    "i tried to write some poetry but it sucked",
    "robyn is a force to be reckoned with",
    "shanx_: yeah, that sounds right :/",
    "um: i owe you a hug for this flesh avoidance",
    "i got to hug a 2 ton cow named Tucker at a farm sanctuary",
    "except his head was like as big as my torso",
    "also sows are excellent for hugs",
    "i am only content with life if i am making things",
    "and poetry is currently my primary outlet",
    "which is making it somewhat better",
    "like, sure, it's for my capitalist overlord",
    "tonight i got like 80% towards setting up my music studi",
    "ok if i wait any longer for dinner i fear i will regret it",
    "so i'm going to walk across the jolly roger parking lot",
    "if i see a problem in htop i'll tell you :)",
    "#leaves is awesome. also I <3 the <3 made of <3",
    "QUICK EVERYONE CHECK THE HEALTH OF THE SERVER *dos*",
    "audy: oh you know, just being puppet",
    "it eventually gets up to like 11% ram",
    "it's barely hitting the CPU right now though",
    "angband and quote bot are what's destroying the cpu",
    "i can go ahead and put a sleep(100) in that tight loop",
    "and then assume jumblesale's user and re-run the script",
    "but that seems highly invasive",
    "I adjusted the nice value of both angband and quote bot",
    "debugging some heinous shit at work",
    "so it only happens if I allow lein to run \"all\" of the tests",
    "if i *just* run against my actual test file it's fine",
    "in theory i can configure it to do the former",
    "joe of tilde.town fame is hanging out",
    "we're listening to noise music",
    "by a confused, rich canadian family",
    "shanx_: might be a while, my dreams are crazy and varied",
    "who knows who will show up next",
    "you can vicariously enjoy them here",
    "i do find that the b12 vitamin enhances memorability",
    "like too many of my formative memories were just dreams",
    "but yeah I knew we shared a love of lovecraft",
    "uugh shit i don't wanna do right now: clean",
    "i am dejectedly doing tjust that",
    "i may still have to do some :(",
    "not sure what those characters were",
    "or larabar and coffee which has been my breakfast for a week",
    "um no worries at all. i can relate to that feel.",
    "and that 9/10 times your Employer Is Your Enemy",
    "plant a garden in the landfill as it were",
    "um: lol no you swell my vanity and make me feel loved",
    "full disclosure i am a drunk person rn",
    "i read it many years ago and it has always stuck wit me",
    "me too--i've only read bits and pieces",
    "jumblesale: friday postcard makes me v. happy",
    "from the japanese garden in portland",
    "talking about form vs content and poetry with some people",
    "now to get it from my phone to irc",
    "i'm drunk but let me know if you need help",
    "brook stopped by with some cider",
    "um: i uh love functional programming",
    "so uh let me know if tilde.town can support your interests",
    "um: yeah, i mean, i'd hang on a nixos box",
    "nixos is wonderfully enigmatic",
    "where immutability scrapes away at the darkness",
    "no one has talked to me on irc yet there",
    "jumblesale: all the more reason to join / hang out there",
    "ie how to not be a Garbage Person",
    "and honestly? I think it takes keeping yr mouth shut",
    "and listening really carefully",
    "i wanna live in 90s technutopia",
    "um: yup, that was me in r/twoxchromosomes and r/feminism",
    "the captain reaches for something to hold on to",
    "i think one has to start there",
    "talking and talking and puking garbage speech and gunpowder",
    "i mean this goes for all humans",
    "joe: yaaaaaaaaaaaaaaaaaaaaaaaaar",
    "the world is ugly and its people are sad",
    "and we can all complain and whine and be sad",
    "but like, it's time to just listen",
    "instead of competing in some fucked up whine off",
    "joe: are you into whitehead / process theology?",
    "um i'll be in NYC like next week",
    "karlen: holy shit am I *so* excited to come to the UK",
    "I am really committed to get there in 2015",
    "my company has an office in London",
    "so like I have a great excuse to fly out and work from there",
    "i'm also up to traveling wherever",
    "and am happy, most definitely, to go up and down britain",
    "in addition to that east/west thing",
    "we just had an all-hands here in portland",
    "and i got to drink with the european folks",
    "the czechs brought some insane 70%abv absinthe",
    "karlen: do you get to wash many lasers??",
    "joe: not an unfamiliar experience. good luck.",
    "karlen: are you a Scientist of sorts",
    "i think i'm just like 'WEST COAST",
    "datagrok: no worries, mine too :)",
    "so that you can write a nice thank you note",
    "because the nice note trumps whatever date you opened it",
    "datagrok: but how is irvin(g)e?",
    "it's more chilly than atlanta?",
    "it got crazy fucking cold here for a bit",
    "but it is hanging out in the high 40s/low 50s rn",
    "I was able to Not Give A Fuck for a while at puppet",
    "but eventually had to decide whether to care or not",
    "but the other very real option was just quitting",
    "that's what kept me at cmgd as long as it did",
    "literally my coworkers and jbruce",
    "hehe i have a new manager at work",
    "and was like \"whhat do you want in a manager\"",
    "and i said \"let me tell you about jbruce\"",
    "karlen[gameboy-run]: best possible mission",
    "lololol i have so much work to do tomorrow",
    "specifically the album Unconditional Acceleration",
    "i believe that is a general 3ds",
    "i haven't experienced it but i've heard about it",
    "the tweet command is pretty straightforward",
    "STDIN is a lost art i've decided",
    "like so many commands take filenames",
    "but like hey you could just use this rad abstraction",
    "but like yes the words you say seem Good and Fair",
    "like mellifluous tones o'er a gilded plain",
    "to try and finish a ton of work before i start on holida",
    "my home is in my hadron collider",
    "um: perhaps you can show me when i visit",
    "but am always caught up in dust storms and sadness",
    "i am looking forward to late night diner fries",
    "i'm from a little ickle rural town ~90mi north of the city",
    "and smoked weed in weird places",
    "my favorite place ever to eat food is in manhattan, fwiw",
    "a buddhist korean place called Hangawi",
    "maja: that sounds like portland :)",
    "ich kann ein nur bisschen deutsche sprechen.",
    "um: definitely, portlanders are a rare sight",
    "ja dass stimmt, deine deutsche ist sehr gut",
    "i'm still working on this garbage poem",
    "um: clojure definitely supports laziness",
    "and is one of the reasons i don't quit my job",
    "it delights in artifice so complex and brain twisting",
    "and the interop is mostly sane",
    "and there is a shitload of awesome java shit you can usel",
    "my company makes some nice libs:",
    "asoiihdoiashd it's 3am curse you lovely people",
    "i will get this poem up and pass out",
    "best part of using a static blog generator",
    "is the experience of pushing poetry straight into production",
    "because my staging server is dead",
    "ok now is time when i try to pass out",
    "so probably it'll be sometime like the 27th-30ths",
    "I mean I'm definitely not a fan",
    "but am slightly less offended by that than yo momma jokes",
    "nossidge: sqlite is a good idea",
    "nossidge: that is what my software does",
    "k, time for me to put clothes on my body",
    "nossidge: you can use it from the command line",
    "you can also use it here on tilde.town",
    "Experimental Computer Poetry As A Service",
    "load \"path to text file\" nossidgedb",
    "or learn to use prosaic or whatever",
    "happy non demoninational holidaze",
    "i had a fun drunken day in nyc with family'",
    "up too late now thanks to time zones",
    "despite having only gotten two hours of sleep",
    "then i'll trick my body into passing out",
    "this poem might be shit, for example",
    "ugh i want scotch and french fries",
    "spent too much time in bars today",
    "happy non denominational holiday",
    "reppard: that radiator is neat :)",
    "but yeah send me an email if you haven't already :)",
    "i'd like to think we can be an anonymous collective",
    "but for now i am one of very few people with sudo",
    "papa: looks like you might want to use this uri:",
    "well, i was a javascript engineer for years",
    "i soured hard on it and have sworn off writing it",
    "yeah I think edna piranha is just awesome",
    "and i produced a ton of other stuff during my js time",
    "i'm back in Python now and much happier",
    "I should like check for security updates",
    "there'll be a restart at some point",
    "restart sucks but got to do em sometimes",
    "till i'm back home with more reliable internet",
    "my parents' router has a tendency to take little naps",
    "inet6 addr: fe80::e6:a9ff:fee1:26c8/64",
    "but i don't think things are listening there",
    "real talk: I don't know shit about ipv6",
    "that's some nationalist objectivist bullshit",
    "I appreciate TR's preservationist tendencies",
    "ok, I've had enough whiskey to want to write some code",
    "how should the user list be sorted?",
    "currently it's modified time of ~/public_html",
    "which is a side effect of, say, vim's save mechanism",
    "but not all forms of file editing",
    "the easy thing is just checking index.html",
    "heh no I'd like a freshness based sort",
    "which is perhaps an unfounded fear",
    "my script is gonna get eaten by a witch",
    "there are worse fates i suppose",
    "(def all-files (-> \"/home/vilmibm\" find list))",
    "kc: donno, but i'm essentially mapping find to stat",
    "which is a scheme-like that compiles to Python AST",
    "hy is the official scripting language of tilde.town in  fact",
    "(->> (.format \"/home/{}/public_html\")",
    "it's a dangerous place out there",
    "(there are two bugs in that code btw ^)",
    "(in case anyone is keeping score)",
    "i haven't used one in many years",
    "but i'm probably going to build a gaming machine this year",
    "and it'll have to run some kind of windoze",
    "yeah i use stock ubuntu on my main machine",
    "cuz just about everything Just Works etc",
    "everything else is either debian stable or testing",
    "awesome. that does sound appealing",
    "indeed, but tries to push too many graphical things",
    "it's why i run debian on my netbook",
    "so each user could have a list",
    "it's probably sufficient to just support a second key",
    "as opposed to an arbitrary list",
    "that's definitely not a requirement",
    "endorphant: you can, but puppet will overwrite the file :(",
    "to have only what keys i've specified via puppet",
    "and it builds that file for you",
    "it's still going, i'm hanging at my parents' until thursday",
    "krowbar[work]: word. my family is now on the opposite coast",
    "so i scheduled some extra time",
    "since i won't see them again probably till october",
    "drinking soy nog with cheap whiske",
    "listening to new wave and (classic) goth",
    "audiodude: awesome. i like your style.",
    "i'm drinking Canadian Club out of a plastic handle",
    "compared to the gnarly shit I pour down my gullet",
    "oh word maybe I'm thinking of something else",
    "carry on, I will drop this cheap whiskey pissing contest",
    "this is actually my first time doing the spiked nog thing",
    "being vegan nog isn't generally a thing i usually drink",
    "but there was some soy nog on sale",
    "oh fuck no idea they did nogggg",
    "hahahaha i just overflowed my own disk quota",
    "um only if you are into that sort of thing literally",
    "deal with anxiety more healthfully",
    "hexdump $(which less) > /dev/mouth",
    "the possibilities are endless and I must know",
    "and one I should likely aspire to",
    "yeah. i always have a book that i'm reading",
    "but sometimes i don't touch it for a week or two",
    "if yr gonna write JS that book is required reading",
    "\"it's just, resolution, conflict, denoument, exposition\"",
    "I offer the olive branch of evil-mode",
    "use vim *and* emacs simultaneously! s'what i do",
    "but it also leads to some delightful domain names",
    "ps I just installed imagemagick",
    "DNS system built using a blockchain",
    "why isn't my colspan property working",
    "kc[afk]: be careful about while True",
    "it will turn yr tight loop into a loose loop :)"
  ],
  "will": [
    "dan: All the links on that page are blocked at my school. :(",
    "Wrote a script to download all of the XKCD comics :D"
  ],
  "yourname": [
    "yay think I got the prettiness going",
    "yeah its the standard for the theme"
  ]
}